

--510010000企业进出口数据
SELECT dbo.ENTRY_HEAD.ENTRY_ID, dbo.ENTRY_HEAD.I_E_FLAG, dbo.ENTRY_HEAD.DECL_PORT, dbo.ENTRY_HEAD.I_E_PORT, dbo.ENTRY_HEAD.D_DATE, dbo.ENTRY_HEAD.TRADE_CO, 
       dbo.ENTRY_HEAD.TRADE_NAME, dbo.ENTRY_HEAD.OWNER_CODE, dbo.ENTRY_HEAD.OWNER_NAME, dbo.ENTRY_HEAD.TRADE_COUNTRY, dbo.ENTRY_HEAD.TRADE_MODE, 
	   dbo.ENTRY_HEAD.CONTAINER_NO, dbo.ENTRY_HEAD.GROSS_WT, dbo.ENTRY_HEAD.NET_WT, dbo.ENTRY_HEAD.MANUAL_NO, dbo.ENTRY_HEAD.RELATIVE_ID, 
	   dbo.ENTRY_HEAD.EDI_REMARK, dbo.ENTRY_HEAD.RELATIVE_MANUAL_NO, dbo.ENTRY_LIST.G_NO, dbo.ENTRY_LIST.CODE_TS, 
	   dbo.ENTRY_LIST.G_NAME, dbo.ENTRY_LIST.G_MODEL, dbo.ENTRY_LIST.ORIGIN_COUNTRY, dbo.ENTRY_LIST.CONTR_ITEM, 
	   dbo.ENTRY_LIST.G_QTY, dbo.ENTRY_LIST.G_UNIT, dbo.ENTRY_LIST.QTY_1, dbo.ENTRY_LIST.UNIT_1, dbo.ENTRY_LIST.QTY_2, dbo.ENTRY_LIST.UNIT_2, 
	   dbo.ENTRY_LIST.USD_PRICE, dbo.ENTRY_LIST.DUTY_VALUE, dbo.ENTRY_LIST.REAL_DUTY, dbo.ENTRY_LIST.REAL_TAX, dbo.ENTRY_LIST.REAL_REG, dbo.ENTRY_LIST.REAL_OIL,
       dbo.ENTRY_LIST.REAL_ANTI,dbo.ENTRY_LIST.PRDT_NO
  FROM dbo.ENTRY_HEAD 
 INNER JOIN dbo.ENTRY_LIST ON dbo.ENTRY_HEAD.ENTRY_ID = dbo.ENTRY_LIST.ENTRY_ID
 WHERE dbo.ENTRY_HEAD.D_DATE Between '2010-01-01' And '2018-01-01' AND dbo.ENTRY_HEAD.TRADE_CO  ='3205341024'
    
  UNION ALL 
SELECT dbo.EXTERNAL_ENTRY_HEAD.ENTRY_ID, dbo.EXTERNAL_ENTRY_HEAD.I_E_FLAG, dbo.EXTERNAL_ENTRY_HEAD.DECL_PORT, dbo.EXTERNAL_ENTRY_HEAD.I_E_PORT, 
       dbo.EXTERNAL_ENTRY_HEAD.D_DATE, dbo.EXTERNAL_ENTRY_HEAD.TRADE_CO, dbo.EXTERNAL_ENTRY_HEAD.TRADE_NAME, dbo.EXTERNAL_ENTRY_HEAD.OWNER_CODE, 
	   dbo.EXTERNAL_ENTRY_HEAD.OWNER_NAME, dbo.EXTERNAL_ENTRY_HEAD.TRADE_COUNTRY, dbo.EXTERNAL_ENTRY_HEAD.TRADE_MODE, dbo.EXTERNAL_ENTRY_HEAD.CONTAINER_NO, 
	   dbo.EXTERNAL_ENTRY_HEAD.GROSS_WT, dbo.EXTERNAL_ENTRY_HEAD.NET_WT, dbo.EXTERNAL_ENTRY_HEAD.MANUAL_NO, dbo.EXTERNAL_ENTRY_HEAD.RELATIVE_ID, dbo.EXTERNAL_ENTRY_HEAD.EDI_REMARK, 
	   dbo.EXTERNAL_ENTRY_HEAD.RELATIVE_MANUAL_NO, dbo.EXTERNAL_ENTRY_LIST.G_NO, dbo.EXTERNAL_ENTRY_LIST.CODE_TS, dbo.EXTERNAL_ENTRY_LIST.G_NAME, dbo.EXTERNAL_ENTRY_LIST.G_MODEL, 
	   dbo.EXTERNAL_ENTRY_LIST.ORIGIN_COUNTRY, dbo.EXTERNAL_ENTRY_LIST.CONTR_ITEM, dbo.EXTERNAL_ENTRY_LIST.G_QTY, dbo.EXTERNAL_ENTRY_LIST.G_UNIT, dbo.EXTERNAL_ENTRY_LIST.QTY_1,
       dbo.EXTERNAL_ENTRY_LIST.UNIT_1, dbo.EXTERNAL_ENTRY_LIST.QTY_2, dbo.EXTERNAL_ENTRY_LIST.UNIT_2, dbo.EXTERNAL_ENTRY_LIST.USD_PRICE, dbo.EXTERNAL_ENTRY_LIST.DUTY_VALUE, 
	   dbo.EXTERNAL_ENTRY_LIST.REAL_DUTY, dbo.EXTERNAL_ENTRY_LIST.REAL_TAX, dbo.EXTERNAL_ENTRY_LIST.REAL_REG, dbo.EXTERNAL_ENTRY_LIST.REAL_OIL, dbo.EXTERNAL_ENTRY_LIST.REAL_ANTI,
	   dbo.EXTERNAL_ENTRY_LIST.PRDT_NO
    FROM dbo.EXTERNAL_ENTRY_HEAD 
   INNER JOIN dbo.EXTERNAL_ENTRY_LIST 
      ON dbo.EXTERNAL_ENTRY_HEAD.ENTRY_ID = dbo.EXTERNAL_ENTRY_LIST.ENTRY_ID 
    WHERE dbo.EXTERNAL_ENTRY_HEAD.D_DATE Between '2010-01-01' And '2018-01-01' AND dbo.EXTERNAL_ENTRY_HEAD.TRADE_CO  ='3205341024'
    

--50200500041生成手册表头明细
SELECT  MASTER_CUSTOMS AS 主管海关, EMS_NO AS 帐册编号, TRADE_CODE AS 经营单位代码, OWNER_CODE AS 收货单位代码, 
	    OWNER_NAME AS 收货单位名称, NEW_APPR_DATE AS 备案批准日期, END_DATE AS 结束有效期, CLEAR_APPL_DATE AS 核销申请日期, CLEAR_DATE AS 最近核销日期,
	    CLOSE_DATE As 结案日期  
  FROM dbo.EMS_HEAD 
  WHERE  (OWNER_CODE = '3205341024') AND  (EMS_NO LIKE N'B%' OR EMS_NO LIKE N'C%' OR EMS_NO LIKE N'E%' OR EMS_NO LIKE N'K%'OR EMS_NO LIKE N'H23%')  

--无数据投资关系
--[510010005]
SELECT TRADE_CO AS 企业编码, INV_NO AS 序号, INV_CO AS 投资者, INV_MOD, INV_FUND AS [投资金额(万美元)], ACT_FUND AS [到位资金(万美元)], INV_DATE AS 投资日期,INV_COUNTRY
  FROM dbo.INVESTER_REL
 WHERE  TRADE_CO = '3205341024'

--投资关系
  SELECT [510010005].企业编码, [510010005].序号, [510010005].投资者, [参数表-投资代码表].投资方式, [510010005].[投资金额(万美元)], [510010005].[到位资金(万美元)], [510010005].投资日期, [参数表-国别代码].中文简称 AS 投资国别
FROM (510010005 LEFT JOIN [参数表-投资代码表] ON [510010005].INV_MOD = [参数表-投资代码表].投资代码) LEFT JOIN [参数表-国别代码] ON [510010005].INV_COUNTRY = [参数表-国别代码].国别代码;

--无数据管理人员
--[5100100051]
SELECT TRADE_CO, MANAG_NO, MANAG_NAME, MANAG_TITLE, MANAG_NAT, MANAG_ID, MANAG_BIR, MANAG_SEX, MANAG_ADDR, MANAG_TEL_BP, MANAG_NOTE,MANAG_DEGREE , MANAG_MAR
  FROM dbo.MANA_REL
 WHERE TRADE_CO = '3205341024'

--管理人员
 SELECT [5100100051].TRADE_CO AS 企业编码, [5100100051].MANAG_NO AS 序号, [5100100051].MANAG_NAME AS 姓名, [参数表-职务代码表].职务, [参数表-国别代码].中文简称 AS 国藉, 
        [5100100051].MANAG_ID AS 身份证, [5100100051].MANAG_BIR AS 出生日期, [5100100051].MANAG_SEX AS 性别, [5100100051].MANAG_ADDR AS 住址, [5100100051].MANAG_TEL_BP AS 联系电话, 
		[5100100051].MANAG_NOTE AS 备注, [参数表-学历代码表].学历, [5100100051].MANAG_MAR AS 资信
FROM ((5100100051 INNER JOIN [参数表-职务代码表] ON [5100100051].MANAG_TITLE = [参数表-职务代码表].职务代码) 
  INNER JOIN [参数表-国别代码] ON [5100100051].MANAG_NAT = [参数表-国别代码].国别代码) INNER JOIN [参数表-学历代码表] ON [5100100051].MANAG_DEGREE = [参数表-学历代码表].学历代码
WHERE ((([5100100051].TRADE_CO)=[Forms]![510010002备案信息基础表]![企业编码]));

--无数据关联企业
--[510010008关联企业]
SELECT dbo.COMPANY_REL.TRADE_CO AS 企业编码, dbo.COMPANY_REL.CUSTOMS_CODE AS 主管海关, dbo.COMPANY_REL.CONTAC_CO AS 联系人, dbo.COMPANY_REL.TEL_CO AS 联系电话,
       dbo.COMPANY_REL.LAW_MAN_TEL AS 法人电话, dbo.COMPANY_REL.ID_NUMBER AS 居留证号
  FROM dbo.COMPANY_REL
 WHERE (dbo.COMPANY_REL.CONTAC_CO='3205341024' and  dbo.COMPANY_REL.CUSTOMS_CODE like '23%') OR (dbo.COMPANY_REL.TEL_CO='" & strTEL_CO & "' and  
 dbo.COMPANY_REL.CUSTOMS_CODE like '23%')  OR (dbo.COMPANY_REL.LAW_MAN_TEL='" & StrLAW_MAN_TEL & "'
  and  dbo.COMPANY_REL.CUSTOMS_CODE like '23%') OR  (dbo.COMPANY_REL.ID_NUMBER='" & StrID_NUMBER & "' and  dbo.COMPANY_REL.CUSTOMS_CODE like '23%')

SELECT [510010008关联企业].企业编码, [510010008关联企业].企业名称, [参数表-关区代码].海关名称 AS 主管海关, [510010008关联企业].类别, [参数表-地区性质代码表].地区性质名称 AS 区域类型, 
       [参数表-企业性质代码表].企业性质简称 AS 性质, [参数表-行业代码表].行业 AS 行业种类, [510010008关联企业].注册日期, [510010008关联企业].通关期限, [510010008关联企业].注册地址, 
	   [510010008关联企业].联系人, [510010008关联企业].联系电话, [510010008关联企业].法人代表, [510010008关联企业].法人电话, [510010008关联企业].居留证号, [510010008关联企业].投资总额, 
	   [510010008关联企业].[注册资本(万)], [510010008关联企业].币制, [510010008关联企业].经营范围
  FROM (((510010008关联企业 LEFT JOIN [参数表-地区性质代码表] ON [510010008关联企业].区域类型 = [参数表-地区性质代码表].地区性质代码) 
   LEFT JOIN [参数表-企业性质代码表] ON [510010008关联企业].性质 = [参数表-企业性质代码表].企业性质代码) 
   LEFT JOIN [参数表-关区代码] ON [510010008关联企业].主管海关 = [参数表-关区代码].海关代码) 
   LEFT JOIN [参数表-行业代码表] ON [510010008关联企业].行业种类 = [参数表-行业代码表].行业代码;


--进出口情况（监管方式）
--取本异地报关单数据D_DATE>=
D_DATE>=[Forms]![510010002备案信息基础表]![起始日期]

--"510010003进出口基础表"=”本异地报关单数据“加上条件“D_DATE>=[Forms]![510010002备案信息基础表]![起始日期]”

--510011001报关单统计基数
SELECT a.进出标志, a.经营单位名称, a.年, a.月, a.申报口岸, a.申报地, a.通关模式, a.贸易国, a.监管方式, Count(a.海关编号) AS 申报票数, 
Sum(a.可查) AS 可查票数, sum(a.毛重) AS 毛重, val(Sum(a.标箱)) AS 标箱, Sum(a.金额) AS 金额, Sum(a.税款) AS 税款
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].毛重, [510010003进出口基础表].贸易国, [510010003进出口基础表].标箱, 
[510010003进出口基础表].经营单位名称, [510010003进出口基础表].年, [510010003进出口基础表].月, [510010003进出口基础表].申报口岸, 
[510010003进出口基础表].申报地, [510010003进出口基础表].通关模式, [510010003进出口基础表].监管方式, [510010003进出口基础表].海关编号,
 [510010003进出口基础表].可查, Sum([510010003进出口基础表].统计美元价) AS 金额, Sum([510010003进出口基础表].税款) AS 税款 
 FROM 510010003进出口基础表 GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].经营单位名称, [510010003进出口基础表].年, 
 [510010003进出口基础表].月, [510010003进出口基础表].申报口岸, [510010003进出口基础表].申报地, [510010003进出口基础表].通关模式, [510010003进出口基础表].贸易国,
  [510010003进出口基础表].毛重, [510010003进出口基础表].标箱, [510010003进出口基础表].监管方式, [510010003进出口基础表].海关编号, [510010003进出口基础表].可查)  AS a
GROUP BY a.进出标志, a.经营单位名称, a.年, a.月, a.申报口岸, a.申报地, a.通关模式, a.贸易国, a.监管方式;


--510011008d
SELECT [510011001报关单统计基数].经营单位名称, [510011001报关单统计基数].进出标志, Sum([510011001报关单统计基数].申报票数) AS 票数, Sum([510011001报关单统计基数].标箱) AS 标箱, 
Sum([510011001报关单统计基数].毛重) AS 毛重, Sum([510011001报关单统计基数].金额) AS 金额, Sum([510011001报关单统计基数].税款) AS 税款
FROM 510011001报关单统计基数
GROUP BY [510011001报关单统计基数].经营单位名称, [510011001报关单统计基数].进出标志;


--510011008c表
SELECT [510011001报关单统计基数].经营单位名称, [510011001报关单统计基数].进出标志, [510011001报关单统计基数].申报地, [510011001报关单统计基数].申报口岸, 
       [510011001报关单统计基数].监管方式, Sum([510011001报关单统计基数].申报票数) AS 票数, Sum([510011001报关单统计基数].标箱) AS 标箱, 
	    Sum(Round([510011001报关单统计基数]![毛重]/1000,2)) AS [货运量(吨)], Sum(Round([510011001报关单统计基数]![金额]/10000,2)) AS [金额(万美元)], 
		Sum(Round([510011001报关单统计基数]![税款]/10000,2)) AS [税款(万元)], Sum([510011001报关单统计基数].金额) AS 金额, 
		Sum([510011001报关单统计基数].税款) AS 税款, Sum([510011001报关单统计基数].毛重) AS 毛重
FROM 510011001报关单统计基数
GROUP BY [510011001报关单统计基数].经营单位名称, [510011001报关单统计基数].进出标志, [510011001报关单统计基数].申报地, [510011001报关单统计基数].申报口岸, [510011001报关单统计基数].监管方式;

--按监控方式
SELECT [510011008c].经营单位名称, [510011008c].进出标志, [510011008c].申报地, [510011008c].申报口岸, [510011008c].监管方式, [510011008c].票数, 
Round([510011008c]![票数]/[510011008d]![票数],4)*100 AS [票数占比%], [510011008c].标箱, Round([510011008c]![标箱]/[510011008d]![标箱],4)*100 AS [标箱占比%], [510011008c].[货运量(吨)], 
Round([510011008c]![毛重]/[510011008d]![毛重],4)*100 AS [货运量占比%], [510011008c].[金额(万美元)], Round([510011008c]![金额]/[510011008d]![金额],4)*100 AS [金额占比%], 
[510011008c].[税款(万元)], IIf(Nz([510011008d]![税款])=0,Null,Round([510011008c]![税款]/[510011008d]![税款],4)*100) AS [税款占比%]
FROM 510011008c LEFT JOIN 510011008d ON ([510011008c].经营单位名称 = [510011008d].经营单位名称) AND ([510011008c].进出标志 = [510011008d].进出标志);



--进出口情况（通关模式）

--510011001报关单统计基数
--参考进出口情况（监管方式）的统计

--510011009d
SELECT [510011001报关单统计基数].经营单位名称, [510011001报关单统计基数].进出标志, Sum([510011001报关单统计基数].申报票数) AS 票数, Sum([510011001报关单统计基数].标箱) AS 标箱, 
Sum([510011001报关单统计基数].毛重) AS 毛重, Sum([510011001报关单统计基数].金额) AS 金额, Sum([510011001报关单统计基数].税款) AS 税款
FROM 510011001报关单统计基数
GROUP BY [510011001报关单统计基数].经营单位名称, [510011001报关单统计基数].进出标志;

--510011009c
SELECT [510011001报关单统计基数].经营单位名称, [510011001报关单统计基数].进出标志, [510011001报关单统计基数].申报地, [510011001报关单统计基数].通关模式, Sum([510011001报关单统计基数].申报票数) AS 票数, Sum([510011001报关单统计基数].标箱) AS 标箱, Sum(Round([510011001报关单统计基数]![毛重]/1000,2)) AS [货运量(吨)], Sum(Round([510011001报关单统计基数]![金额]/10000,2)) AS [金额(万美元)], Sum(Round([510011001报关单统计基数]![税款]/10000,2)) AS [税款(万元)], Sum([510011001报关单统计基数].金额) AS 金额, Sum([510011001报关单统计基数].税款) AS 税款, Sum([510011001报关单统计基数].毛重) AS 毛重
FROM 510011001报关单统计基数
GROUP BY [510011001报关单统计基数].经营单位名称, [510011001报关单统计基数].进出标志, [510011001报关单统计基数].申报地, [510011001报关单统计基数].通关模式;

--通关模式
SELECT [510011009c].经营单位名称, [510011009c].进出标志, [510011009c].申报地, [510011009c].通关模式, [510011009c].票数, 
Round([510011009c]![票数]/[510011009d]![票数],4)*100 AS [票数占比%], [510011009c].标箱, Round([510011009c]![标箱]/[510011009d]![标箱],4)*100 AS [标箱占比%], 
[510011009c].[货运量(吨)], Round([510011009c]![毛重]/[510011009d]![毛重],4)*100 AS [货运量占比%], [510011009c].[金额(万美元)], 
Round([510011009c]![金额]/[510011009d]![金额],4)*100 AS [金额占比%], [510011009c].[税款(万元)], IIf(Nz([510011009d]![税款])=0,Null,
Round([510011009c]![税款]/[510011009d]![税款],4)*100) AS [税款占比%]
FROM 510011009c LEFT JOIN 510011009d ON ([510011009c].进出标志 = [510011009d].进出标志) AND ([510011009c].经营单位名称 = [510011009d].经营单位名称);



--进出口情况月度态势
--”510010003进出口基础表“参考“进出口情况（监管方式）”计算方式

SELECT a.进出标志, a.经营单位名称, a.年, a.月, a.申报口岸, a.申报地, a.通关模式, a.贸易国, a.监管方式, Count(a.海关编号) AS 申报票数, Sum(a.可查) AS 可查票数, sum(a.毛重) AS 毛重, 
      val(Sum(a.标箱)) AS 标箱, Sum(a.金额) AS 金额, Sum(a.税款) AS 税款
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].毛重, [510010003进出口基础表].贸易国, [510010003进出口基础表].标箱, [510010003进出口基础表].经营单位名称, 
             [510010003进出口基础表].年, [510010003进出口基础表].月, [510010003进出口基础表].申报口岸, [510010003进出口基础表].申报地, [510010003进出口基础表].通关模式, 
			 [510010003进出口基础表].监管方式, [510010003进出口基础表].海关编号, [510010003进出口基础表].可查, Sum([510010003进出口基础表].统计美元价) AS 金额, 
			 Sum([510010003进出口基础表].税款) AS 税款 
	   FROM 510010003进出口基础表 GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].经营单位名称, [510010003进出口基础表].年, [510010003进出口基础表].月, 
	   [510010003进出口基础表].申报口岸, [510010003进出口基础表].申报地, [510010003进出口基础表].通关模式, [510010003进出口基础表].贸易国, [510010003进出口基础表].毛重,
	    [510010003进出口基础表].标箱, [510010003进出口基础表].监管方式, [510010003进出口基础表].海关编号, [510010003进出口基础表].可查)  AS a
GROUP BY a.进出标志, a.经营单位名称, a.年, a.月, a.申报口岸, a.申报地, a.通关模式, a.贸易国, a.监管方式;

--查询进出口报关单
--”510010003进出口基础表“参考“进出口情况（监管方式）”计算方式

--申报现场分布图
--数据源同进出口情况（监管方式）

--通关模式展示图
--510011009c、510011009d表参考“进出口情况（通关模式）”

--数据来源（510011009e）
SELECT [510011009c].经营单位名称, [510011009c].进出标志, [510011009c].申报地, [510011009c].通关模式, [510011009c].票数, Round([510011009c]![票数]/[510011009d]![票数],4)*100 AS [票数占比%], 
       [510011009c].标箱, Round([510011009c]![标箱]/[510011009d]![标箱],4)*100 AS [标箱占比%], [510011009c].[货运量(吨)], Round([510011009c]![毛重]/[510011009d]![毛重],4)*100 AS [货运量占比%], 
       [510011009c].[金额(万美元)], Round([510011009c]![金额]/[510011009d]![金额],4)*100 AS [金额占比%], [510011009c].[税款(万元)], IIf(Nz([510011009d]![税款])=0,Null,
       Round([510011009c]![税款]/[510011009d]![税款],4)*100) AS [税款占比%]
FROM 510011009c LEFT JOIN 510011009d ON ([510011009c].进出标志 = [510011009d].进出标志) AND ([510011009c].经营单位名称 = [510011009d].经营单位名称);

---贸易方式展示图
--数据源同进出口情况（监管方式）



--贸易国家分布图

--510011008d、510011001报关单统计基数 参考进出口情况（监管方式）

--510011008a
SELECT [510011001报关单统计基数].经营单位名称, [510011001报关单统计基数].进出标志, [510011001报关单统计基数].申报地, [510011001报关单统计基数].贸易国, [510011001报关单统计基数].监管方式, 
		Sum([510011001报关单统计基数].申报票数) AS 票数, Sum([510011001报关单统计基数].标箱) AS 标箱, Sum(Round([510011001报关单统计基数]![毛重]/1000,2)) AS [货运量(吨)], 
		Sum(Round([510011001报关单统计基数]![金额]/10000,2)) AS [金额(万美元)], Sum(Round([510011001报关单统计基数]![税款]/10000,2)) AS [税款(万元)], Sum([510011001报关单统计基数].金额) AS 金额, 
		Sum([510011001报关单统计基数].税款) AS 税款, Sum([510011001报关单统计基数].毛重) AS 毛重
FROM 510011001报关单统计基数
GROUP BY [510011001报关单统计基数].经营单位名称, [510011001报关单统计基数].进出标志, [510011001报关单统计基数].申报地, [510011001报关单统计基数].贸易国, [510011001报关单统计基数].监管方式;


--数据统计脚本（510011008b(按贸易国)）
SELECT [510011008a].经营单位名称, [510011008a].进出标志, [510011008a].申报地, [510011008a].贸易国, [510011008a].监管方式, [510011008a].票数, 
Round([510011008a]![票数]/[510011008d]![票数],4)*100 AS [票数占比%], [510011008a].标箱, Round([510011008a]![标箱]/[510011008d]![标箱],4)*100 AS [标箱占比%], 
[510011008a].[货运量(吨)], Round([510011008a]![毛重]/[510011008d]![毛重],4)*100 AS [货运量占比%], [510011008a].[金额(万美元)], 
Round([510011008a]![金额]/[510011008d]![金额],4)*100 AS [金额占比%], [510011008a].[税款(万元)], IIf(Nz([510011008d]![税款])=0,Null,
Round([510011008a]![税款]/[510011008d]![税款],4)*100) AS [税款占比%]
FROM 510011008a LEFT JOIN 510011008d ON ([510011008a].进出标志 = [510011008d].进出标志) AND ([510011008a].经营单位名称 = [510011008d].经营单位名称);


---------------------------------------------------------------------------------------------------------------------------------
--查验情况统计

--”510010003进出口基础表“参考“进出口情况（监管方式）”计算方式

--中间表-查验情况表头

--5100110063查获表体
SELECT [中间表-查验情况表头].海关编号, [中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].进出口标志, [中间表-查验情况表头].查验方式（代码）, [中间表-查验情况表头].查验处理, 
		[中间表-查验情况表头].查验结果, [中间表-查验情况表头].风险类型, dbo_RSK_EXAM_LIST_REL.EXAM_RESULT, dbo_RSK_EXAM_LIST_REL.CODE_TS AS 商品编号, 
		dbo_RSK_EXAM_LIST_REL.G_NAME AS 商品名称, dbo_RSK_EXAM_LIST_REL.G_MODEL AS 规格型号, IIf(Left([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],2)="02",Null,
		Left([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],2)) AS 1, IIf(Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],3,2)="02",Null,Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],3,2)) AS 2, 
		IIf(Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],5,2)="02",Null,Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],5,2)) AS 3, 
		IIf(Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],7,2)="02",Null,Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],7,2)) AS 4, 
		IIf(Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],9,2)="02",Null,Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],9,2)) AS 5, 
		IIf(Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],11,2)="02",Null,Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],11,2)) AS 6, 
		IIf(Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],13,2)="02",Null,Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],13,2)) AS 7, 
		IIf(Right([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],2)="02",Null,Right([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],2)) AS 8, [中间表-查验情况表头].人工查验记录, [中间表-查验情况表头].机器查验记录
FROM [中间表-查验情况表头] LEFT JOIN dbo_RSK_EXAM_LIST_REL ON [中间表-查验情况表头].查验记录单号 = dbo_RSK_EXAM_LIST_REL.EXAM_REC_ID
WHERE ((([中间表-查验情况表头].查验结果)="查获") AND ((IIf(Left([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],2)="02",Null,Left([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],2))) Is Not Null)) 
OR ((([中间表-查验情况表头].查验结果)="查获") AND ((IIf(Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],3,2)="02",Null,Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],3,2))) Is Not Null)) 
OR ((([中间表-查验情况表头].查验结果)="查获") AND ((IIf(Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],5,2)="02",Null,Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],5,2))) Is Not Null)) 
OR ((([中间表-查验情况表头].查验结果)="查获") AND ((IIf(Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],7,2)="02",Null,Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],7,2))) Is Not Null)) 
OR ((([中间表-查验情况表头].查验结果)="查获") AND ((IIf(Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],9,2)="02",Null,Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],9,2))) Is Not Null)) 
OR ((([中间表-查验情况表头].查验结果)="查获") AND ((IIf(Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],11,2)="02",Null,Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],11,2))) Is Not Null)) 
OR ((([中间表-查验情况表头].查验结果)="查获") AND ((IIf(Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],13,2)="02",Null,Mid([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],13,2))) Is Not Null)) 
OR ((([中间表-查验情况表头].查验结果)="查获") AND ((IIf(Right([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],2)="02",Null,Right([dbo_RSK_EXAM_LIST_REL]![EXAM_RESULT],2))) Is Not Null));


-- 5100110064查获风险特征
SELECT [5100110063查获表体].海关编号, [5100110063查获表体].查验记录单号, [5100110063查获表体].进出口标志, [5100110063查获表体].查验方式（代码）, [5100110063查获表体].查验处理,
 [5100110063查获表体].查验结果, [5100110063查获表体].风险类型, [1] & [2] & [3] & [4] & [5] & [6] & [7] & [8] AS l, 
 IIf(IsNull([风险类型]),[l],[风险类型]) AS 风险特征, [参数表-查验处理代码(商品项)].风险 AS 1, [参数表-查验处理代码(商品项)_5].风险 AS 2, 
 [参数表-查验处理代码(商品项)_1].风险 AS 3, [参数表-查验处理代码(商品项)_2].风险 AS 4, [参数表-查验处理代码(商品项)_3].风险 AS 5, [参数表-查验处理代码(商品项)_4].风险 AS 6, 
 [参数表-查验处理代码(商品项)_6].风险 AS 7, [参数表-查验处理代码(商品项)_7].风险 AS 8
FROM (((((((5100110063查获表体 
LEFT JOIN [参数表-查验处理代码(商品项)] AS [参数表-查验处理代码(商品项)_5] ON [5100110063查获表体].[2] = [参数表-查验处理代码(商品项)_5].代码) 
LEFT JOIN [参数表-查验处理代码(商品项)] AS [参数表-查验处理代码(商品项)_1] ON [5100110063查获表体].[3] = [参数表-查验处理代码(商品项)_1].代码) 
LEFT JOIN [参数表-查验处理代码(商品项)] AS [参数表-查验处理代码(商品项)_2] ON [5100110063查获表体].[4] = [参数表-查验处理代码(商品项)_2].代码) 
LEFT JOIN [参数表-查验处理代码(商品项)] AS [参数表-查验处理代码(商品项)_3] ON [5100110063查获表体].[5] = [参数表-查验处理代码(商品项)_3].代码) 
LEFT JOIN [参数表-查验处理代码(商品项)] AS [参数表-查验处理代码(商品项)_4] ON [5100110063查获表体].[6] = [参数表-查验处理代码(商品项)_4].代码) 
LEFT JOIN [参数表-查验处理代码(商品项)] AS [参数表-查验处理代码(商品项)_6] ON [5100110063查获表体].[7] = [参数表-查验处理代码(商品项)_6].代码) 
LEFT JOIN [参数表-查验处理代码(商品项)] AS [参数表-查验处理代码(商品项)_7] ON [5100110063查获表体].[8] = [参数表-查验处理代码(商品项)_7].代码) 
LEFT JOIN [参数表-查验处理代码(商品项)] ON [5100110063查获表体].[1] = [参数表-查验处理代码(商品项)].代码;



--5100110065查验拼接表
SELECT DISTINCT [510010003进出口基础表].海关编号, [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].进出口岸, 
[510010003进出口基础表].监管方式, [510010003进出口基础表].通关模式, [510010003进出口基础表].可查, [中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验方式（代码）, 
[中间表-查验情况表头].查验处理, [中间表-查验情况表头].查验结果, [5100110064查获风险特征].风险特征, [中间表-查验情况表头].人工查验记录, [中间表-查验情况表头].机器查验记录
FROM (510010003进出口基础表 LEFT JOIN [中间表-查验情况表头] 
    ON [510010003进出口基础表].海关编号 = [中间表-查验情况表头].海关编号) 
LEFT JOIN 5100110064查获风险特征 ON [510010003进出口基础表].海关编号 = [5100110064查获风险特征].海关编号;

--数据结果表
SELECT [5100110065查验拼接表].进出标志, [5100110065查验拼接表].申报地, [5100110065查验拼接表].监管方式, [5100110065查验拼接表].通关模式, Sum([5100110065查验拼接表].可查) AS 可查票数, 
Count([5100110065查验拼接表].查验记录单号) AS 查验票数, Count([5100110065查验拼接表].查验结果) AS 查获票数, Sum(IIf([5100110065查验拼接表]![风险特征]="安全",1,0)) AS 安全准入
FROM 5100110065查验拼接表
GROUP BY [5100110065查验拼接表].进出标志, [5100110065查验拼接表].申报地, [5100110065查验拼接表].监管方式, [5100110065查验拼接表].通关模式;


----查获报关单

--”510010003进出口基础表“参考“进出口情况（监管方式）”计算方式
--中间表-查验情况表头
--“5100110064查获风险特征”参考“查验情况统计”计算方式


--数据结果表
SELECT [510010003进出口基础表].通关模式, [510010003进出口基础表].海关编号, [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, 
	[510010003进出口基础表].进出口岸, [510010003进出口基础表].监管方式, [510010003进出口基础表].贸易国, [510010003进出口基础表].标箱, [510010003进出口基础表].毛重, 
	[510010003进出口基础表].净重, [510010003进出口基础表].手册号, [510010003进出口基础表].序号, [510010003进出口基础表].商品编号, [510010003进出口基础表].规格型号, [510010003进出口基础表].产销国, 
	[510010003进出口基础表].重量, [510010003进出口基础表].统计美元价, [510010003进出口基础表].完税价格, [510010003进出口基础表].税款, [中间表-查验情况表头].查验记录单号, 
	[中间表-查验情况表头].查验方式（代码）, [中间表-查验情况表头].查验处理, [中间表-查验情况表头].查验结果, [中间表-查验情况表头].结果评估, [5100110064查获风险特征].风险特征, 
	[中间表-查验情况表头].人工查验记录, [中间表-查验情况表头].机器查验记录
FROM (510010003进出口基础表 LEFT JOIN [中间表-查验情况表头] ON [510010003进出口基础表].海关编号 = [中间表-查验情况表头].海关编号) 
LEFT JOIN 5100110064查获风险特征 ON [510010003进出口基础表].海关编号 = [5100110064查获风险特征].海关编号
WHERE ((([中间表-查验情况表头].查验结果)="查获"));


-----查获商品风险

--“5100110063查获表体”参考“5100110063查获表体”计算方式

--数据结果表
SELECT [5100110063查获表体].海关编号, [5100110063查获表体].商品编号, [5100110063查获表体].商品名称, [5100110063查获表体].规格型号, [5100110063查获表体].查验记录单号, 
[5100110063查获表体].进出口标志, [5100110063查获表体].查验方式（代码）, [5100110063查获表体].查验处理, [5100110063查获表体].查验结果, [1] & [2] & [3] & [4] & [5] & [6] & [7] & [8] AS 查获类型, 
[5100110063查获表体].人工查验记录, [5100110063查获表体].机器查验记录, [参数表-查验处理代码(商品项)].查获类型 AS 1, [参数表-查验处理代码(商品项)_5].查获类型 AS 2, 
[参数表-查验处理代码(商品项)_1].查获类型 AS 3, [参数表-查验处理代码(商品项)_2].查获类型 AS 4, [参数表-查验处理代码(商品项)_3].查获类型 AS 5, [参数表-查验处理代码(商品项)_4].查获类型 AS 6, 
[参数表-查验处理代码(商品项)_6].查获类型 AS 7, [参数表-查验处理代码(商品项)_7].查获类型 AS 8
FROM (((((((5100110063查获表体 LEFT JOIN [参数表-查验处理代码(商品项)] AS [参数表-查验处理代码(商品项)_5] ON [5100110063查获表体].[2] = [参数表-查验处理代码(商品项)_5].代码) 
LEFT JOIN [参数表-查验处理代码(商品项)] AS [参数表-查验处理代码(商品项)_1] ON [5100110063查获表体].[3] = [参数表-查验处理代码(商品项)_1].代码) 
LEFT JOIN [参数表-查验处理代码(商品项)] AS [参数表-查验处理代码(商品项)_2] ON [5100110063查获表体].[4] = [参数表-查验处理代码(商品项)_2].代码) 
LEFT JOIN [参数表-查验处理代码(商品项)] AS [参数表-查验处理代码(商品项)_3] ON [5100110063查获表体].[5] = [参数表-查验处理代码(商品项)_3].代码) 
LEFT JOIN [参数表-查验处理代码(商品项)] AS [参数表-查验处理代码(商品项)_4] ON [5100110063查获表体].[6] = [参数表-查验处理代码(商品项)_4].代码) 
LEFT JOIN [参数表-查验处理代码(商品项)] AS [参数表-查验处理代码(商品项)_6] ON [5100110063查获表体].[7] = [参数表-查验处理代码(商品项)_6].代码) 
LEFT JOIN [参数表-查验处理代码(商品项)] AS [参数表-查验处理代码(商品项)_7] ON [5100110063查获表体].[8] = [参数表-查验处理代码(商品项)_7].代码) 
LEFT JOIN [参数表-查验处理代码(商品项)] ON [5100110063查获表体].[1] = [参数表-查验处理代码(商品项)].代码;


---------------------------------一般贸易业务-----------------------------------------------------------------------------------
--整体进出口情况

----”510010003进出口基础表“参考“进出口情况（监管方式）”计算方式
----中间表-查验情况表头

--数据结果表
SELECT a.进出标志, a.申报地, Count(a.海关编号) AS 票数, Count(a.查验记录单号) AS 查验票数, Count(a.查验结果) AS 查获票数, Val(Sum(a.标箱)) AS 标箱, Sum(a.毛重) AS 毛重, 
Sum(a.净重) AS 净重, Round(Sum(a.统计美元价之合计)/10000,2) AS [金额(万美元)], Round(Val(Sum(a.税款之合计))/10000,2) AS [税款(万元)]
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, 
	[510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].标箱, [510010003进出口基础表].毛重, [510010003进出口基础表].净重, 
	Sum([510010003进出口基础表].统计美元价) AS 统计美元价之合计, Sum([510010003进出口基础表].税款) AS 税款之合计, [510010003进出口基础表].通关模式, 
	[中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验结果 
	FROM 510010003进出口基础表 LEFT JOIN [中间表-查验情况表头] ON [510010003进出口基础表].海关编号 = [中间表-查验情况表头].海关编号 
	GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, 
	[510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].标箱, [510010003进出口基础表].毛重, 
	[510010003进出口基础表].净重, [510010003进出口基础表].通关模式, [中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验结果
	 HAVING ((([510010003进出口基础表].监管方式)="一般贸易")))  AS a
GROUP BY a.进出标志, a.申报地;


---贸易国家分布图

--数据统计结果和“整体进出口情况”数据源相同，区别在于统计的维度不同。此模块不需要开发，将结果图整合到“整体进出口情况”模块

--数据结果表
SELECT a.进出标志, a.申报地, Count(a.海关编号) AS 票数, Count(a.查验记录单号) AS 查验票数, Count(a.查验结果) AS 查获票数, Val(Sum(a.标箱)) AS 标箱, Sum(a.毛重) AS 毛重, 
Sum(a.净重) AS 净重, Round(Sum(a.统计美元价之合计)/10000,2) AS [金额(万美元)], Round(Val(Sum(a.税款之合计))/10000,2) AS [税款(万元)], a.年, a.月, a.申报口岸, a.贸易国, a.通关模式
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, 
[510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].标箱, [510010003进出口基础表].毛重, [510010003进出口基础表].净重, 
Sum([510010003进出口基础表].统计美元价) AS 统计美元价之合计, Sum([510010003进出口基础表].税款) AS 税款之合计, [510010003进出口基础表].通关模式, [中间表-查验情况表头].查验记录单号,
 [中间表-查验情况表头].查验结果 
 FROM 510010003进出口基础表 LEFT JOIN [中间表-查验情况表头] ON [510010003进出口基础表].海关编号 = [中间表-查验情况表头].海关编号 
 GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, 
 [510010003进出口基础表].年, [510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].标箱, 
 [510010003进出口基础表].毛重, [510010003进出口基础表].净重, [510010003进出口基础表].通关模式, [中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验结果 
 HAVING ((([510010003进出口基础表].监管方式)="一般贸易")))  AS a
GROUP BY a.进出标志, a.申报地, a.年, a.月, a.申报口岸, a.贸易国, a.通关模式;


----申报口岸分布图

--数据统计结果和“整体进出口情况”数据源相同，区别在于统计的维度不同。此模块不需要开发，将结果图整合到“整体进出口情况”模块

--数据结果表
SELECT a.进出标志, a.申报地, Count(a.海关编号) AS 票数, Count(a.查验记录单号) AS 查验票数, Count(a.查验结果) AS 查获票数, Val(Sum(a.标箱)) AS 标箱, Sum(a.毛重) AS 毛重, 
Sum(a.净重) AS 净重, Round(Sum(a.统计美元价之合计)/10000,2) AS [金额(万美元)], Round(Val(Sum(a.税款之合计))/10000,2) AS [税款(万元)], a.年, a.月, a.申报口岸, a.贸易国, a.通关模式
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, 
[510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].标箱, [510010003进出口基础表].毛重, [510010003进出口基础表].净重, 
Sum([510010003进出口基础表].统计美元价) AS 统计美元价之合计, Sum([510010003进出口基础表].税款) AS 税款之合计, [510010003进出口基础表].通关模式, [中间表-查验情况表头].查验记录单号, 
[中间表-查验情况表头].查验结果 
FROM 510010003进出口基础表 LEFT JOIN [中间表-查验情况表头] ON [510010003进出口基础表].海关编号 = [中间表-查验情况表头].海关编号 
GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, 
[510010003进出口基础表].年, [510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].标箱, 
[510010003进出口基础表].毛重, [510010003进出口基础表].净重, [510010003进出口基础表].通关模式, [中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验结果 
HAVING ((([510010003进出口基础表].监管方式)="一般贸易")))  AS a
GROUP BY a.进出标志, a.申报地, a.年, a.月, a.申报口岸, a.贸易国, a.通关模式;


-------通关模式展示图

--数据统计结果和“整体进出口情况”数据源相同，区别在于统计的维度不同。此模块不需要开发，将结果图整合到“整体进出口情况”模块

--数据结果表
SELECT a.进出标志, a.申报地, Count(a.海关编号) AS 票数, Count(a.查验记录单号) AS 查验票数, Count(a.查验结果) AS 查获票数, Val(Sum(a.标箱)) AS 标箱, Sum(a.毛重) AS 毛重, Sum(a.净重) AS 净重, 
Round(Sum(a.统计美元价之合计)/10000,2) AS [金额(万美元)], Round(Val(Sum(a.税款之合计))/10000,2) AS [税款(万元)], a.年, a.月, a.申报口岸, a.贸易国, a.通关模式
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, 
[510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].标箱, [510010003进出口基础表].毛重, [510010003进出口基础表].净重, 
Sum([510010003进出口基础表].统计美元价) AS 统计美元价之合计, Sum([510010003进出口基础表].税款) AS 税款之合计, [510010003进出口基础表].通关模式, [中间表-查验情况表头].查验记录单号, 
[中间表-查验情况表头].查验结果 
FROM 510010003进出口基础表 LEFT JOIN [中间表-查验情况表头] ON [510010003进出口基础表].海关编号 = [中间表-查验情况表头].海关编号 
GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, 
[510010003进出口基础表].年, [510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].标箱, 
[510010003进出口基础表].毛重, [510010003进出口基础表].净重, [510010003进出口基础表].通关模式, [中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验结果 
HAVING ((([510010003进出口基础表].监管方式)="一般贸易")))  AS a
GROUP BY a.进出标志, a.申报地, a.年, a.月, a.申报口岸, a.贸易国, a.通关模式;



--------月度进出口态势

--510011009c、510011009d表参考“进出口情况（通关模式）”

--数据结果表
SELECT [510011009c].经营单位名称, [510011009c].进出标志, [510011009c].申报地, [510011009c].通关模式, [510011009c].票数, Round([510011009c]![票数]/[510011009d]![票数],4)*100 AS [票数占比%], 
[510011009c].标箱, Round([510011009c]![标箱]/[510011009d]![标箱],4)*100 AS [标箱占比%], [510011009c].[货运量(吨)], 
Round([510011009c]![毛重]/[510011009d]![毛重],4)*100 AS [货运量占比%], [510011009c].[金额(万美元)], Round([510011009c]![金额]/[510011009d]![金额],4)*100 AS [金额占比%], 
[510011009c].[税款(万元)], IIf(Nz([510011009d]![税款])=0,Null,Round([510011009c]![税款]/[510011009d]![税款],4)*100) AS [税款占比%]
FROM 510011009c LEFT JOIN 510011009d ON ([510011009c].进出标志 = [510011009d].进出标志) AND ([510011009c].经营单位名称 = [510011009d].经营单位名称);



----主要商品结构

----”[5100110065查验拼接表]“参考“查验情况统计”计算方式

--数据结果表
SELECT [5100110065查验拼接表].进出标志, [5100110065查验拼接表].申报地, [5100110065查验拼接表].监管方式, [5100110065查验拼接表].通关模式, Sum([5100110065查验拼接表].可查) AS 可查票数, 
Count([5100110065查验拼接表].查验记录单号) AS 查验票数, Count([5100110065查验拼接表].查验结果) AS 查获票数, Sum(IIf([5100110065查验拼接表]![风险特征]="安全",1,0)) AS 安全准入
FROM 5100110065查验拼接表
GROUP BY [5100110065查验拼接表].进出标志, [5100110065查验拼接表].申报地, [5100110065查验拼接表].监管方式, [5100110065查验拼接表].通关模式;


-----进口商品监控


----”510010003进出口基础表“参考“进出口情况（监管方式）”计算方式

--510020003a最高重量价
SELECT a.进出标志, a.商品编号, max(a.最高重量价) AS 最高重量价
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].监管方式, [510010003进出口基础表].商品编号, [510010003进出口基础表].统计美元价, 
[510010003进出口基础表].法定数量, [510010003进出口基础表].重量, Round([统计美元价]/[重量],2) AS 最高重量价 
FROM 510010003进出口基础表 GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].监管方式, [510010003进出口基础表].商品编号, [510010003进出口基础表].统计美元价, 
[510010003进出口基础表].法定数量, [510010003进出口基础表].重量 HAVING ((([510010003进出口基础表].监管方式)="一般贸易")))  AS a
GROUP BY a.进出标志, a.商品编号;


--510020003b最低重量价
SELECT a.进出标志, a.商品编号, min(a.最高重量价) AS 最低重量价
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].监管方式, [510010003进出口基础表].商品编号, [510010003进出口基础表].统计美元价, 
[510010003进出口基础表].法定数量, [510010003进出口基础表].重量, Round([统计美元价]/[重量],2) AS 最高重量价 
FROM 510010003进出口基础表 GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].监管方式, [510010003进出口基础表].商品编号, [510010003进出口基础表].统计美元价, 
[510010003进出口基础表].法定数量, [510010003进出口基础表].重量 
HAVING ((([510010003进出口基础表].监管方式)="一般贸易")))  AS a
GROUP BY a.进出标志, a.商品编号;


--510020003c最高法定价
SELECT a.进出标志, a.商品编号, max(a.最高法定价) AS 最高法定价
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].监管方式, [510010003进出口基础表].商品编号, [510010003进出口基础表].统计美元价, [510010003进出口基础表].法定数量, 
[510010003进出口基础表].重量, Round([统计美元价]/[法定数量],2) AS 最高法定价 
FROM 510010003进出口基础表 GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].监管方式, [510010003进出口基础表].商品编号, [510010003进出口基础表].统计美元价, 
[510010003进出口基础表].法定数量, [510010003进出口基础表].重量 HAVING ((([510010003进出口基础表].监管方式)="一般贸易")))  AS a
GROUP BY a.进出标志, a.商品编号;


--510020003d最低法定价
SELECT a.进出标志, a.商品编号, min(a.最高法定价) AS 最低法定价
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].监管方式, [510010003进出口基础表].商品编号, [510010003进出口基础表].统计美元价, [510010003进出口基础表].法定数量, 
[510010003进出口基础表].重量, Round([统计美元价]/[法定数量],2) AS 最高法定价 
FROM 510010003进出口基础表 
GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].监管方式, [510010003进出口基础表].商品编号, 
[510010003进出口基础表].统计美元价, [510010003进出口基础表].法定数量, [510010003进出口基础表].重量 
HAVING ((([510010003进出口基础表].监管方式)="一般贸易")))  AS a
GROUP BY a.进出标志, a.商品编号;


--5100200032一般贸易商品合计
SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].监管方式, Sum([510010003进出口基础表].重量) AS 重量, Sum([510010003进出口基础表].统计美元价) AS 统计美元价, 
Sum([510010003进出口基础表].税款) AS 税款, Sum([510010003进出口基础表].法定数量) AS 法定数量
FROM 510010003进出口基础表
GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].监管方式
HAVING ((([510010003进出口基础表].监管方式)="一般贸易"));

--0000100001商品章节 
SELECT a.*, Left(a.商品编号,8) AS 前8位
FROM (SELECT [参数表-商品章节].商品编号, [参数表-商品章节].商品名称, [参数表-商品章节].征税要求标志, [参数表-商品章节].第一计量, 
[参数表-商品章节].第二计量, [参数表-商品章节].[最惠国%], [参数表-商品章节].[普通%], [参数表-商品章节].从量优惠, 
[参数表-商品章节].从量普通, [参数表-商品章节].从量计量, [参数表-商品章节].出口税率, [参数表-商品章节].消费税, [参数表-商品章节].增值税, 
[参数表-商品章节].监管要求, [参数表-商品章节].归类备注,[参数表-商品章节].截止日期
FROM [参数表-商品章节]
union
SELECT dbo_COMPLEX.CODE_TS AS 商品编号, dbo_COMPLEX.G_NAME AS 商品名称, dbo_COMPLEX.TARIFF_MARK AS 征税要求标记, dbo_COMPLEX.UNIT_1 AS 第一计量, dbo_COMPLEX.UNIT_2 AS 第二计量, 
dbo_COMPLEX.LOW_RATE AS [最惠国%], dbo_COMPLEX.HIGH_RATE AS 普通, dbo_COMPLEX.COM_Q_LOW_RATE AS 从量优惠, dbo_COMPLEX.COM_Q_HIGH_RATE AS 从量普通, 
dbo_COMPLEX.COM_UNIT_FLAG AS 从量计量, dbo_COMPLEX.OUT_RATE AS 出口税率, dbo_COMPLEX.REG_RATE AS 消费税, dbo_COMPLEX.TAX_RATE AS 增值税, dbo_COMPLEX.CONTROL_MARK AS 监管要求, 
dbo_COMPLEX.NOTE_S AS 归类备注, dbo_COMPLEX.END_DATE AS 截止日期
FROM dbo_COMPLEX
WHERE (((dbo_COMPLEX.END_DATE)>=Date()))
)  AS a;

--0000100000商品综合分类表
SELECT [0000100001商品章节].商品编号, [0000100001商品章节].商品名称, IIf(IsNull([参数表-归类备注].归类备注),[0000100001商品章节].归类备注,[参数表-归类备注].归类备注) AS 归类备注, 
[参数表-归类备注].申报要素, [0000100001商品章节].征税要求标志, [0000100001商品章节].第一计量, [0000100001商品章节].第二计量, 
IIf(IsNull([参数表-出口退税率].退税率),[参数表-出口退税率_1].退税率,[参数表-出口退税率].退税率) AS 退税率, [0000100001商品章节].[最惠国%], [0000100001商品章节].[普通%], 
[0000100001商品章节].从量优惠, [0000100001商品章节].从量普通, [0000100001商品章节].从量计量, [0000100001商品章节].出口税率, [0000100001商品章节].消费税, [0000100001商品章节].增值税, 
[0000100001商品章节].监管要求, [参数表-归类备注].加贸禁止, [0000100001商品章节].截止日期
FROM ((0000100001商品章节 
LEFT JOIN [参数表-出口退税率] ON [0000100001商品章节].商品编号 = [参数表-出口退税率].商品编码) 
LEFT JOIN [参数表-出口退税率] AS [参数表-出口退税率_1] ON [0000100001商品章节].前8位 = [参数表-出口退税率_1].商品编码) 
LEFT JOIN [参数表-归类备注] ON [0000100001商品章节].商品编号 = [参数表-归类备注].商品编号;


---5100200031一般贸易商品均价
SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].经营单位名称, [510010003进出口基础表].监管方式, [510010003进出口基础表].商品编号, [0000100000商品综合分类表].商品名称 AS 税则列名, 
	[0000100000商品综合分类表].归类备注, Sum([510010003进出口基础表].重量) AS 重量, Sum([510010003进出口基础表].统计美元价) AS 统计美元价, [510010003进出口基础表].第一计量, 
	Sum([510010003进出口基础表].税款) AS 税款, Sum([510010003进出口基础表].法定数量) AS 法定数量, Round(Sum([510010003进出口基础表]![统计美元价])/Sum([510010003进出口基础表]![法定数量]),2) AS 法定均价, 
	Round(Sum([510010003进出口基础表]![统计美元价])/Sum([510010003进出口基础表]![重量]),2) AS 重量均价, 
	IIf([进出标志]="I",[0000100000商品综合分类表]![最惠国%],[0000100000商品综合分类表]![退税率]) AS [关(退)税率]
FROM 510010003进出口基础表 
LEFT JOIN 0000100000商品综合分类表 ON [510010003进出口基础表].商品编号 = [0000100000商品综合分类表].商品编号
GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].经营单位名称, [510010003进出口基础表].监管方式, [510010003进出口基础表].商品编号, 
[0000100000商品综合分类表].商品名称, [0000100000商品综合分类表].归类备注, [510010003进出口基础表].第一计量, 
IIf([进出标志]="I",[0000100000商品综合分类表]![最惠国%],[0000100000商品综合分类表]![退税率])
HAVING ((([510010003进出口基础表].监管方式)="一般贸易"));

--数据结果表
SELECT [5100200031一般贸易商品均价].进出标志, [5100200031一般贸易商品均价].[关(退)税率] AS 关税率, [5100200031一般贸易商品均价].商品编号, [5100200031一般贸易商品均价].税则列名, 
[5100200031一般贸易商品均价].归类备注, [5100200031一般贸易商品均价].第一计量, [5100200031一般贸易商品均价].法定数量, [5100200031一般贸易商品均价].重量, 
Round([5100200031一般贸易商品均价]![重量]/[5100200032一般贸易商品合计]![重量],2) AS 本企业重量占比, Round([5100200031一般贸易商品均价]![统计美元价]/10000,2) AS [金额(万美元)], 
Round([5100200031一般贸易商品均价]![统计美元价]/[5100200032一般贸易商品合计]![统计美元价],2) AS 本企业金额占比, 
Round([5100200031一般贸易商品均价]![税款]/10000,2) AS [税款(万元)], [510020003d最低法定价].最低法定价, [510020003c最高法定价].最高法定价, [5100200031一般贸易商品均价].法定均价, 
[510020003b最低重量价].最低重量价, [510020003a最高重量价].最高重量价, [5100200031一般贸易商品均价].重量均价
FROM ((((5100200031一般贸易商品均价 
LEFT JOIN 510020003a最高重量价 ON ([5100200031一般贸易商品均价].商品编号 = [510020003a最高重量价].商品编号) AND ([5100200031一般贸易商品均价].进出标志 = [510020003a最高重量价].进出标志)) 
LEFT JOIN 510020003b最低重量价 ON ([5100200031一般贸易商品均价].商品编号 = [510020003b最低重量价].商品编号) AND ([5100200031一般贸易商品均价].进出标志 = [510020003b最低重量价].进出标志)) 
LEFT JOIN 510020003c最高法定价 ON ([5100200031一般贸易商品均价].商品编号 = [510020003c最高法定价].商品编号) AND ([5100200031一般贸易商品均价].进出标志 = [510020003c最高法定价].进出标志)) 
LEFT JOIN 510020003d最低法定价 ON ([5100200031一般贸易商品均价].商品编号 = [510020003d最低法定价].商品编号) AND ([5100200031一般贸易商品均价].进出标志 = [510020003d最低法定价].进出标志)) 
LEFT JOIN 5100200032一般贸易商品合计 ON [5100200031一般贸易商品均价].进出标志 = [5100200032一般贸易商品合计].进出标志
WHERE ((([5100200031一般贸易商品均价].进出标志)="I"))
ORDER BY Round([5100200031一般贸易商品均价]![统计美元价]/10000,2) DESC;



-------出口商品监控

--“5100200031一般贸易商品均价” 参考“进口商品监控”模块计算

--”5100200032一般贸易商品合计“参考“进口商品监控”模块计算

--数据结果表
SELECT [5100200031一般贸易商品均价].进出标志, [5100200031一般贸易商品均价].[关(退)税率] AS 退税率, [5100200031一般贸易商品均价].商品编号, [5100200031一般贸易商品均价].税则列名, 
[5100200031一般贸易商品均价].归类备注, [5100200031一般贸易商品均价].第一计量, [5100200031一般贸易商品均价].法定数量, [5100200031一般贸易商品均价].重量, 
Round([5100200031一般贸易商品均价]![重量]/[5100200032一般贸易商品合计]![重量],2) AS 本企业重量占比, Round([5100200031一般贸易商品均价]![统计美元价]/10000,2) AS [金额(万美元)], 
Round([5100200031一般贸易商品均价]![统计美元价]/[5100200032一般贸易商品合计]![统计美元价],2) AS 本企业金额占比, [5100200031一般贸易商品均价].法定均价, [5100200031一般贸易商品均价].重量均价
FROM 5100200031一般贸易商品均价 
LEFT JOIN 5100200032一般贸易商品合计 ON [5100200031一般贸易商品均价].进出标志 = [5100200032一般贸易商品合计].进出标志
WHERE ((([5100200031一般贸易商品均价].进出标志)="E"))
ORDER BY Round([5100200031一般贸易商品均价]![统计美元价]/10000,2) DESC;


-------------------------------------------------------加工贸易保税业务----------------------------------------------------------

--整体进出口情况

--510010003进出口基础表
--中间表-查验情况表头

--数据结果表(本模块参照“一般贸易业务—整体进出口情况“)
SELECT a.进出标志, a.申报地, a.监管方式, Count(a.海关编号) AS 票数, Count(a.查验记录单号) AS 查验票数, Count(a.查验结果) AS 查获票数, Val(Sum(a.标箱)) AS 标箱, Sum(a.毛重) AS 毛重, 
Sum(a.净重) AS 净重, Round(Sum(a.统计美元价之合计)/10000,2) AS [金额(万美元)], Round(Val(Sum(a.税款之合计))/10000,2) AS [税款(万元)]
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, 
[510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].备注, [510010003进出口基础表].标箱, 
[510010003进出口基础表].毛重, [510010003进出口基础表].净重, Sum([510010003进出口基础表].统计美元价) AS 统计美元价之合计, Sum([510010003进出口基础表].税款) AS 税款之合计, 
[510010003进出口基础表].通关模式, [中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验结果 
FROM 510010003进出口基础表 LEFT JOIN [中间表-查验情况表头] ON [510010003进出口基础表].海关编号 = [中间表-查验情况表头].海关编号 
GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, 
[510010003进出口基础表].年, [510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].备注, 
[510010003进出口基础表].标箱, [510010003进出口基础表].毛重, [510010003进出口基础表].净重, [510010003进出口基础表].通关模式, 
[中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验结果 
HAVING ((([510010003进出口基础表].备注)="加贸")))  AS a
GROUP BY a.进出标志, a.申报地, a.监管方式;



---申报口岸分布图

--510010003进出口基础表
--中间表-查验情况表头

--数据结果表(本模块参照“一般贸易业务—申报口岸分布图“)
SELECT a.进出标志, a.申报地, a.监管方式, Count(a.海关编号) AS 票数, Count(a.查验记录单号) AS 查验票数, Count(a.查验结果) AS 查获票数, Val(Sum(a.标箱)) AS 标箱, Sum(a.毛重) AS 毛重, 
Sum(a.净重) AS 净重, Round(Sum(a.统计美元价之合计)/10000,2) AS [金额(万美元)], Round(Val(Sum(a.税款之合计))/10000,2) AS [税款(万元)], a.年, a.月, a.申报口岸, a.贸易国, a.通关模式
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, 
[510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].备注, [510010003进出口基础表].标箱, 
[510010003进出口基础表].毛重, [510010003进出口基础表].净重, Sum([510010003进出口基础表].统计美元价) AS 统计美元价之合计, Sum([510010003进出口基础表].税款) AS 税款之合计, 
[510010003进出口基础表].通关模式, [中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验结果 
FROM 510010003进出口基础表 LEFT JOIN [中间表-查验情况表头] ON [510010003进出口基础表].海关编号 = [中间表-查验情况表头].海关编号 
GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, 
[510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].备注, [510010003进出口基础表].标箱, 
[510010003进出口基础表].毛重, [510010003进出口基础表].净重, [510010003进出口基础表].通关模式, [中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验结果 
HAVING ((([510010003进出口基础表].备注)="加贸")))  AS a
GROUP BY a.进出标志, a.申报地, a.年, a.月, a.申报口岸, a.监管方式, a.贸易国, a.通关模式;


---进出重量倒挂

--中间表-手册报关单(还末找到计算逻辑)

--502009001结案手册进口重量
SELECT DISTINCT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].海关编号, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].备案批准日期, [中间表-手册报关单].最近核销日期, [中间表-手册报关单].申报日期, [中间表-手册报关单].贸易方式, [中间表-手册报关单].净重 AS 净重之合计
FROM [中间表-手册报关单]
WHERE ((([中间表-手册报关单].帐册编号) Like "B*" Or ([中间表-手册报关单].帐册编号) Like "C*") AND (([中间表-手册报关单].进出口标志)="I") 
AND (([中间表-手册报关单].贸易方式) Not Like "边角料*" And ([中间表-手册报关单].贸易方式) Not Like "料件内销" 
And ([中间表-手册报关单].贸易方式) Not Like "料件销毁" And ([中间表-手册报关单].贸易方式) Not Like "后续补税"));

--502009009料件销毁
SELECT DISTINCT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].海关编号, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].最近核销日期, [中间表-手册报关单].申报日期, [中间表-手册报关单].贸易方式, [中间表-手册报关单].净重
FROM [中间表-手册报关单]
WHERE ((([中间表-手册报关单].帐册编号) Like "B*" Or ([中间表-手册报关单].帐册编号) Like "C*") AND (([中间表-手册报关单].进出口标志)="I") AND (([中间表-手册报关单].贸易方式) Like "料件销毁"));


--502009010料件销毁累计
SELECT [502009009料件销毁].帐册编号, Sum([502009009料件销毁].净重) AS 料件销毁
FROM 502009009料件销毁
GROUP BY [502009009料件销毁].帐册编号;

--502009005边角料销毁复出
SELECT DISTINCT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].海关编号, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].最近核销日期, [中间表-手册报关单].申报日期, [中间表-手册报关单].贸易方式, [中间表-手册报关单].净重
FROM [中间表-手册报关单]
WHERE ((([中间表-手册报关单].帐册编号) Like "B*" Or ([中间表-手册报关单].帐册编号) Like "C*") AND (([中间表-手册报关单].进出口标志)="I") 
AND (([中间表-手册报关单].贸易方式) Like "边角料销毁")) OR ((([中间表-手册报关单].帐册编号) Like "B*" Or ([中间表-手册报关单].帐册编号) Like "C*") 
AND (([中间表-手册报关单].进出口标志)="E") AND (([中间表-手册报关单].贸易方式) Like "边角料复出"));


--502009006边角料销毁复出累计
SELECT [502009005边角料销毁复出].主管海关, [502009005边角料销毁复出].帐册编号, [502009005边角料销毁复出].收货单位名称, Sum([502009005边角料销毁复出].净重) AS 边角料销毁复出
FROM 502009005边角料销毁复出
GROUP BY [502009005边角料销毁复出].主管海关, [502009005边角料销毁复出].帐册编号, [502009005边角料销毁复出].收货单位名称;

--502009012重量核减累计
SELECT [502009011结案手册出口重量].主管海关, [502009011结案手册出口重量].帐册编号, [502009011结案手册出口重量].收货单位名称, [502009011结案手册出口重量].进出口标志, 
Sum([502009011结案手册出口重量].净重之合计) AS 出口重量核减
FROM 502009011结案手册出口重量
GROUP BY [502009011结案手册出口重量].主管海关, [502009011结案手册出口重量].帐册编号, [502009011结案手册出口重量].收货单位名称, [502009011结案手册出口重量].进出口标志;

--502009003边角料征税
SELECT DISTINCT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].海关编号, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].最近核销日期, [中间表-手册报关单].申报日期, [中间表-手册报关单].贸易方式, [中间表-手册报关单].净重
FROM [中间表-手册报关单]
WHERE ((([中间表-手册报关单].帐册编号) Like "B*" Or ([中间表-手册报关单].帐册编号) Like "C*") AND (([中间表-手册报关单].进出口标志)="I") AND (([中间表-手册报关单].贸易方式) Like "边角料"));

--502009004边角料征税累计
SELECT [502009003边角料征税].主管海关, [502009003边角料征税].帐册编号, [502009003边角料征税].收货单位名称, Sum([502009003边角料征税].净重) AS 边角料征税
FROM 502009003边角料征税
GROUP BY [502009003边角料征税].主管海关, [502009003边角料征税].帐册编号, [502009003边角料征税].收货单位名称;

--502009002重量核增累计
SELECT [502009001结案手册进口重量].主管海关, [502009001结案手册进口重量].帐册编号, [502009001结案手册进口重量].收货单位名称, [502009001结案手册进口重量].备案批准日期, 
[502009001结案手册进口重量].最近核销日期, [502009001结案手册进口重量].进出口标志, Sum([502009001结案手册进口重量].净重之合计) AS 进口重量核增
FROM 502009001结案手册进口重量
GROUP BY [502009001结案手册进口重量].主管海关, [502009001结案手册进口重量].帐册编号, [502009001结案手册进口重量].收货单位名称, 
[502009001结案手册进口重量].备案批准日期, [502009001结案手册进口重量].最近核销日期, [502009001结案手册进口重量].进出口标志;



--502009013结案手册重量
SELECT [502009002重量核增累计].主管海关, [502009002重量核增累计].帐册编号, [502009002重量核增累计].收货单位名称, [502009002重量核增累计].备案批准日期, [502009002重量核增累计].最近核销日期, 
[502009002重量核增累计].进口重量核增, [502009012重量核减累计].出口重量核减, [502009008料件内销累计].料件内销补税, [502009010料件销毁累计].料件销毁, [502009004边角料征税累计].边角料征税, 
[502009006边角料销毁复出累计].边角料销毁复出, Nz([进口重量核增])-Nz([出口重量核减])-Nz([料件内销补税])-Nz([料件销毁])-Nz([边角料征税])-Nz([边角料销毁复出]) AS 进出倒挂重量
FROM ((((502009002重量核增累计 LEFT JOIN 502009008料件内销累计 ON [502009002重量核增累计].帐册编号 = [502009008料件内销累计].帐册编号) 
LEFT JOIN 502009004边角料征税累计 ON [502009002重量核增累计].帐册编号 = [502009004边角料征税累计].帐册编号) 
LEFT JOIN 502009012重量核减累计 ON [502009002重量核增累计].帐册编号 = [502009012重量核减累计].帐册编号) 
LEFT JOIN 502009006边角料销毁复出累计 ON [502009002重量核增累计].帐册编号 = [502009006边角料销毁复出累计].帐册编号) 
LEFT JOIN 502009010料件销毁累计 ON [502009002重量核增累计].帐册编号 = [502009010料件销毁累计].帐册编号;


--数据结果表
SELECT [502009013结案手册重量].主管海关, [502009013结案手册重量].帐册编号, [502009013结案手册重量].收货单位名称, [502009013结案手册重量].备案批准日期, 
[502009013结案手册重量].最近核销日期, [502009013结案手册重量].进口重量核增, [502009013结案手册重量].出口重量核减, [502009013结案手册重量].料件内销补税, 
[502009013结案手册重量].料件销毁, [502009013结案手册重量].边角料征税, [502009013结案手册重量].边角料销毁复出, [502009013结案手册重量].进出倒挂重量, 
Round([进出倒挂重量]/[进口重量核增],2) AS 倒挂比率
FROM 502009013结案手册重量
WHERE (((Round([进出倒挂重量]/[进口重量核增],2))>0.25))
ORDER BY Round([进出倒挂重量]/[进口重量核增],2) DESC;



-----月度进出口态势

----”510010003进出口基础表“参考“进出口情况（监管方式）”计算方式
--中间表-查验情况表头

--数据结果表
SELECT a.进出标志, a.申报地, a.监管方式, Count(a.海关编号) AS 票数, Count(a.查验记录单号) AS 查验票数, Count(a.查验结果) AS 查获票数, Val(Sum(a.标箱)) AS 标箱, 
Sum(a.毛重) AS 毛重, Sum(a.净重) AS 净重, Round(Sum(a.统计美元价之合计)/10000,2) AS [金额(万美元)], Round(Val(Sum(a.税款之合计))/10000,2) AS [税款(万元)], a.年, a.月, 
a.申报口岸, a.贸易国, a.通关模式
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, 
[510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].备注, [510010003进出口基础表].标箱, 
[510010003进出口基础表].毛重, [510010003进出口基础表].净重, Sum([510010003进出口基础表].统计美元价) AS 统计美元价之合计, Sum([510010003进出口基础表].税款) AS 税款之合计, 
[510010003进出口基础表].通关模式, [中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验结果 
FROM 510010003进出口基础表 LEFT JOIN [中间表-查验情况表头] ON [510010003进出口基础表].海关编号 = [中间表-查验情况表头].海关编号 
GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, 
[510010003进出口基础表].年, [510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].备注, 
[510010003进出口基础表].标箱, [510010003进出口基础表].毛重, [510010003进出口基础表].净重, [510010003进出口基础表].通关模式, [中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验结果 
HAVING ((([510010003进出口基础表].备注)="加贸")))  AS a
GROUP BY a.进出标志, a.申报地, a.年, a.月, a.申报口岸, a.监管方式, a.贸易国, a.通关模式;


------特殊贸易方式

----”510010003进出口基础表“参考“进出口情况（监管方式）”计算方式
--中间表-查验情况表头

--数据结果表
SELECT a.进出标志, a.申报地, a.监管方式, Count(a.海关编号) AS 票数, Count(a.查验记录单号) AS 查验票数, Count(a.查验结果) AS 查获票数, Val(Sum(a.标箱)) AS 标箱, 
Sum(a.毛重) AS 毛重, Sum(a.净重) AS 净重, Round(Sum(a.统计美元价之合计)/10000,2) AS [金额(万美元)], 
Round(Val(Sum(a.税款之合计))/10000,2) AS [税款(万元)], a.年, a.月, a.申报口岸, a.贸易国, a.通关模式
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, 
[510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].备注, [510010003进出口基础表].标箱, [510010003进出口基础表].毛重, 
[510010003进出口基础表].净重, Sum([510010003进出口基础表].统计美元价) AS 统计美元价之合计, Sum([510010003进出口基础表].税款) AS 税款之合计, [510010003进出口基础表].通关模式, 
[中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验结果 
FROM 510010003进出口基础表 LEFT JOIN [中间表-查验情况表头] ON [510010003进出口基础表].海关编号 = [中间表-查验情况表头].海关编号 
GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, 
[510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].备注, [510010003进出口基础表].标箱, 
[510010003进出口基础表].毛重, [510010003进出口基础表].净重, [510010003进出口基础表].通关模式, [中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验结果 
HAVING ((([510010003进出口基础表].备注)="加贸")))  AS a
GROUP BY a.进出标志, a.申报地, a.年, a.月, a.申报口岸, a.监管方式, a.贸易国, a.通关模式;



----手账册执行情况

--中间表-手册表头临时表1
--中间表-手册报关单


--5030100025边角料销毁
SELECT a.主管海关, a.帐册编号, a.收货单位名称, a.进出口标志, a.贸易类别, sum(a.净重) AS 销毁净重, sum(a.美元值) AS 销毁金额
FROM (SELECT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, 
[中间表-手册报关单].贸易类别, [中间表-手册报关单].净重, Sum([中间表-手册报关单].统计美元价) AS 美元值 
FROM [中间表-手册报关单] 
GROUP BY [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].贸易方式, [中间表-手册报关单].贸易类别, [中间表-手册报关单].净重 
HAVING ((([中间表-手册报关单].进出口标志)="I") AND (([中间表-手册报关单].贸易方式) Like "*销毁")))  AS a
GROUP BY a.主管海关, a.帐册编号, a.收货单位名称, a.进出口标志, a.贸易类别;


--5030100024边角料内销
SELECT a.主管海关, a.帐册编号, a.收货单位名称, a.进出口标志, a.贸易类别, sum(a.净重) AS 边角料内销净重, sum(a.美元值) AS 边角料内销金额, sum(a.边角料征税) AS 边角料征税
FROM (SELECT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, 
[中间表-手册报关单].贸易类别, [中间表-手册报关单].净重, Sum([中间表-手册报关单].统计美元价) AS 美元值, Sum([中间表-手册报关单].征税) AS 边角料征税 
FROM [中间表-手册报关单] 
GROUP BY [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, 
[中间表-手册报关单].贸易类别, [中间表-手册报关单].净重 
HAVING ((([中间表-手册报关单].进出口标志)="I") AND (([中间表-手册报关单].贸易方式)="料件内销")))  AS a
GROUP BY a.主管海关, a.帐册编号, a.收货单位名称, a.进出口标志, a.贸易类别;

--5030100023料件内销
SELECT a.主管海关, a.帐册编号, a.收货单位名称, a.进出口标志, a.贸易类别, sum(a.净重) AS 料件内销净重, sum(a.美元值) AS 料件内销金额, sum(a.料件征税) AS 料件征税
FROM (SELECT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].贸易方式, [中间表-手册报关单].贸易类别, [中间表-手册报关单].净重, Sum([中间表-手册报关单].统计美元价) AS 美元值, sum([中间表-手册报关单].征税) AS 料件征税 
FROM [中间表-手册报关单] GROUP BY [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].贸易方式, [中间表-手册报关单].贸易类别, [中间表-手册报关单].净重 
HAVING ((([中间表-手册报关单].进出口标志)="I") AND (([中间表-手册报关单].贸易方式)="料件内销")))  AS a
GROUP BY a.主管海关, a.帐册编号, a.收货单位名称, a.进出口标志, a.贸易类别;

--5030100027结转出口
SELECT a.主管海关, a.帐册编号, a.收货单位名称, a.进出口标志, a.贸易类别, sum(a.净重) AS 结转出口净重, sum(a.美元值) AS 结转出口金额
FROM (SELECT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].贸易方式, [中间表-手册报关单].贸易类别, [中间表-手册报关单].净重, Sum([中间表-手册报关单].统计美元价) AS 美元值 
FROM [中间表-手册报关单] 
GROUP BY [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].贸易方式, [中间表-手册报关单].贸易类别, [中间表-手册报关单].净重 
HAVING ((([中间表-手册报关单].进出口标志)="E") AND (([中间表-手册报关单].贸易方式)="深加工结转")))  AS a
GROUP BY a.主管海关, a.帐册编号, a.收货单位名称, a.进出口标志, a.贸易类别;

--5030100026实际出口
SELECT a.主管海关, a.帐册编号, a.收货单位名称, a.进出口标志, a.贸易类别, sum(a.净重) AS 实出净重, sum(a.美元值) AS 实出金额
FROM (SELECT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].贸易方式, [中间表-手册报关单].贸易类别, [中间表-手册报关单].净重, Sum([中间表-手册报关单].统计美元价) AS 美元值 
FROM [中间表-手册报关单] 
GROUP BY [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, 
[中间表-手册报关单].贸易类别, [中间表-手册报关单].净重 HAVING ((([中间表-手册报关单].进出口标志)="E") AND (([中间表-手册报关单].贸易方式)="实际进出")))  AS a
GROUP BY a.主管海关, a.帐册编号, a.收货单位名称, a.进出口标志, a.贸易类别;

--5030100022手册结转进口
SELECT a.主管海关, a.帐册编号, a.收货单位名称, a.进出口标志, a.贸易类别, sum(a.净重) AS 结转进口净重, sum(a.美元值) AS 结转进口金额
FROM (SELECT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].贸易方式, [中间表-手册报关单].贸易类别, [中间表-手册报关单].净重, Sum([中间表-手册报关单].统计美元价) AS 美元值, [中间表-手册报关单].征税 
FROM [中间表-手册报关单] 
GROUP BY [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].贸易方式, [中间表-手册报关单].贸易类别, [中间表-手册报关单].净重, [中间表-手册报关单].征税 
HAVING ((([中间表-手册报关单].进出口标志)="I") AND (([中间表-手册报关单].贸易方式)="深加工结转")))  AS a
GROUP BY a.主管海关, a.帐册编号, a.收货单位名称, a.进出口标志, a.贸易类别;

--5030100021手册实际进口
SELECT a.主管海关, a.帐册编号, a.收货单位名称, a.进出口标志, a.贸易类别, sum(a.净重) AS 实进净重, sum(a.美元值) AS 实进金额
FROM (SELECT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, 
[中间表-手册报关单].贸易类别, [中间表-手册报关单].净重 AS 净重, Sum([中间表-手册报关单].统计美元价) AS 美元值 
FROM [中间表-手册报关单] 
GROUP BY [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].贸易方式, [中间表-手册报关单].贸易类别, [中间表-手册报关单].净重 
HAVING ((([中间表-手册报关单].进出口标志)="I") AND (([中间表-手册报关单].贸易方式)="实际进出")))  AS a
GROUP BY a.主管海关, a.帐册编号, a.收货单位名称, a.进出口标志, a.贸易类别;

--503010002手册进出口情况
SELECT [中间表-手册表头临时表1].主管海关, [中间表-手册表头临时表1].收货单位名称, [中间表-手册表头临时表1].帐册编号, CDate(Format([中间表-手册表头临时表1]![备案批准日期],"yyyy/mm/dd")) AS 备案日期, 
IIf([中间表-手册表头临时表1]![备案批准日期] Between [Forms]![企业综合业务查询]![起始日期] And ([Forms]![企业综合业务查询]![结束日期]+1),1,0) AS 备案数, 
IIf(IsNull([中间表-手册表头临时表1]![最近核销日期]),Null,CDate(Format([中间表-手册表头临时表1]![最近核销日期],"yyyy/mm/dd"))) AS 最近核销日期, [中间表-手册表头临时表1].结案日期, 
IIf(IsNull([中间表-手册表头临时表1]![结案日期]),0,1) AS 结案数, IIf(IsNull([中间表-手册表头临时表1]![结案日期]),1,0) AS 在执行状态, [5030100021手册实际进口].实进净重, 
[5030100022手册结转进口].结转进口净重, [5030100026实际出口].实出净重, [5030100027结转出口].结转出口净重, [5030100023料件内销].料件内销净重, [5030100024边角料内销].边角料内销净重, 
[5030100025边角料销毁].销毁净重, [5030100021手册实际进口].实进金额, [5030100026实际出口].实出金额, [5030100022手册结转进口].结转进口金额, [5030100027结转出口].结转出口金额, 
[5030100023料件内销].料件内销金额, [5030100024边角料内销].边角料内销金额, [5030100025边角料销毁].销毁金额, [5030100023料件内销].料件征税, [5030100024边角料内销].边角料征税
FROM (((((([中间表-手册表头临时表1] 
LEFT JOIN 5030100021手册实际进口 ON [中间表-手册表头临时表1].帐册编号 = [5030100021手册实际进口].帐册编号) 
LEFT JOIN 5030100022手册结转进口 ON [中间表-手册表头临时表1].帐册编号 = [5030100022手册结转进口].帐册编号) 
LEFT JOIN 5030100026实际出口 ON [中间表-手册表头临时表1].帐册编号 = [5030100026实际出口].帐册编号) 
LEFT JOIN 5030100027结转出口 ON [中间表-手册表头临时表1].帐册编号 = [5030100027结转出口].帐册编号) 
LEFT JOIN 5030100023料件内销 ON [中间表-手册表头临时表1].帐册编号 = [5030100023料件内销].帐册编号) 
LEFT JOIN 5030100024边角料内销 ON [中间表-手册表头临时表1].帐册编号 = [5030100024边角料内销].帐册编号) 
LEFT JOIN 5030100025边角料销毁 ON [中间表-手册表头临时表1].帐册编号 = [5030100025边角料销毁].帐册编号
GROUP BY [中间表-手册表头临时表1].主管海关, [中间表-手册表头临时表1].收货单位名称, [中间表-手册表头临时表1].帐册编号, 
CDate(Format([中间表-手册表头临时表1]![备案批准日期],"yyyy/mm/dd")), IIf([中间表-手册表头临时表1]![备案批准日期] Between [Forms]![企业综合业务查询]![起始日期] 
And ([Forms]![企业综合业务查询]![结束日期]+1),1,0), IIf(IsNull([中间表-手册表头临时表1]![最近核销日期]),Null,CDate(Format([中间表-手册表头临时表1]![最近核销日期],"yyyy/mm/dd"))),
 [中间表-手册表头临时表1].结案日期, IIf(IsNull([中间表-手册表头临时表1]![结案日期]),0,1), IIf(IsNull([中间表-手册表头临时表1]![结案日期]),1,0), [5030100021手册实际进口].实进净重,
  [5030100022手册结转进口].结转进口净重, [5030100026实际出口].实出净重, [5030100027结转出口].结转出口净重, [5030100023料件内销].料件内销净重, [5030100024边角料内销].边角料内销净重, 
  [5030100025边角料销毁].销毁净重, [5030100021手册实际进口].实进金额, [5030100026实际出口].实出金额, [5030100022手册结转进口].结转进口金额, [5030100027结转出口].结转出口金额,
   [5030100023料件内销].料件内销金额, [5030100024边角料内销].边角料内销金额, [5030100025边角料销毁].销毁金额, [5030100023料件内销].料件征税, [5030100024边角料内销].边角料征税;


--数据结果表
SELECT [503010002手册进出口情况].主管海关, [503010002手册进出口情况].收货单位名称, Sum([503010002手册进出口情况].备案数) AS 备案数, Sum([503010002手册进出口情况].结案数) AS 结案数, 
Sum([503010002手册进出口情况].在执行状态) AS 在执行, Sum([503010002手册进出口情况].实进净重) AS 实进净重, Sum([503010002手册进出口情况].结转进口净重) AS 结转进口净重, 
Sum([503010002手册进出口情况].实出净重) AS 实出净重, Sum([503010002手册进出口情况].结转出口净重) AS 结转出口净重, Sum([503010002手册进出口情况].料件内销净重) AS 料件内销净重, 
Sum([503010002手册进出口情况].边角料内销净重) AS 边角料内销净重, Sum([503010002手册进出口情况].销毁净重) AS 销毁净重, Sum([503010002手册进出口情况].料件征税) AS 料件征税之合计, 
Sum([503010002手册进出口情况].边角料征税) AS 边角料征税, Sum([503010002手册进出口情况].实进金额) AS 实进金额, Sum([503010002手册进出口情况].实出金额) AS 实出金额, 
Sum([503010002手册进出口情况].结转进口金额) AS 结转进口金额, Sum([503010002手册进出口情况].结转出口金额) AS 结转出口金额, Sum([503010002手册进出口情况].料件内销金额) AS 料件内销金额, 
Sum([503010002手册进出口情况].边角料内销金额) AS 边角料内销金额, Sum([503010002手册进出口情况].销毁金额) AS 销毁金额
FROM 503010002手册进出口情况
GROUP BY [503010002手册进出口情况].主管海关, [503010002手册进出口情况].收货单位名称;


--结案金额倒挂

--中间表-手册报关单

--502010009料件退换复出
SELECT DISTINCT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].海关编号, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].备案批准日期, [中间表-手册报关单].最近核销日期, [中间表-手册报关单].申报日期, [中间表-手册报关单].贸易方式, [中间表-手册报关单].商品序号, [中间表-手册报关单].统计美元价
FROM [中间表-手册报关单]
WHERE ((([中间表-手册报关单].帐册编号) Like "B*" Or ([中间表-手册报关单].帐册编号) Like "C*") AND (([中间表-手册报关单].进出口标志)="E") 
AND (([中间表-手册报关单].最近核销日期) Is Not Null) AND (([中间表-手册报关单].贸易方式)="料件退换" Or ([中间表-手册报关单].贸易方式)="料件复出"));


--502010010退换复出累计
SELECT [502010009料件退换复出].帐册编号, Sum([502010009料件退换复出].统计美元价) AS 料件退换复出
FROM 502010009料件退换复出
GROUP BY [502010009料件退换复出].帐册编号;


--502010017成品退换进
SELECT DISTINCT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].海关编号, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].备案批准日期, [中间表-手册报关单].最近核销日期, [中间表-手册报关单].申报日期, [中间表-手册报关单].贸易方式, [中间表-手册报关单].商品序号, [中间表-手册报关单].统计美元价
FROM [中间表-手册报关单]
WHERE ((([中间表-手册报关单].帐册编号) Like "B*" Or ([中间表-手册报关单].帐册编号) Like "C*") AND (([中间表-手册报关单].进出口标志)="I") 
AND (([中间表-手册报关单].最近核销日期) Is Not Null) AND (([中间表-手册报关单].贸易方式)="成品退换"));


--502010018成品退进累计
SELECT [502010017成品退换进].帐册编号, Sum([502010017成品退换进].统计美元价) AS 成品退进
FROM 502010017成品退换进
GROUP BY [502010017成品退换进].帐册编号;


--502010015成品退换出
SELECT DISTINCT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].海关编号, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].备案批准日期, [中间表-手册报关单].最近核销日期, [中间表-手册报关单].申报日期, [中间表-手册报关单].贸易方式, [中间表-手册报关单].商品序号, [中间表-手册报关单].统计美元价
FROM [中间表-手册报关单]
WHERE ((([中间表-手册报关单].帐册编号) Like "B*" Or ([中间表-手册报关单].帐册编号) Like "C*") AND (([中间表-手册报关单].进出口标志)="E") 
AND (([中间表-手册报关单].最近核销日期) Is Not Null) AND (([中间表-手册报关单].贸易方式)="成品退换"));


--502010016成品退出累计
SELECT [502010015成品退换出].帐册编号, [502010015成品退换出].统计美元价 AS 成品退出
FROM 502010015成品退换出
GROUP BY [502010015成品退换出].帐册编号, [502010015成品退换出].统计美元价;

--502010013余料转出
SELECT DISTINCT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].海关编号, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].备案批准日期, [中间表-手册报关单].最近核销日期, [中间表-手册报关单].申报日期, [中间表-手册报关单].贸易方式, [中间表-手册报关单].商品序号, [中间表-手册报关单].统计美元价
FROM [中间表-手册报关单]
WHERE ((([中间表-手册报关单].帐册编号) Like "B*" Or ([中间表-手册报关单].帐册编号) Like "C*") AND (([中间表-手册报关单].进出口标志)="E") 
AND (([中间表-手册报关单].最近核销日期) Is Not Null) AND (([中间表-手册报关单].贸易方式)="余料结转"));


--502010014余料转出累计
SELECT [502010013余料转出].帐册编号, Sum([502010013余料转出].统计美元价) AS 余料转出
FROM 502010013余料转出
GROUP BY [502010013余料转出].帐册编号;

--502010007料件销毁
SELECT DISTINCT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].备案批准日期, [中间表-手册报关单].最近核销日期, [中间表-手册报关单].申报日期, 
[中间表-手册报关单].贸易方式, [中间表-手册报关单].商品序号, [中间表-手册报关单].统计美元价
FROM [中间表-手册报关单]
WHERE ((([中间表-手册报关单].进出口标志)="I") AND (([中间表-手册报关单].最近核销日期) Is Not Null) AND (([中间表-手册报关单].贸易方式)="料件销毁"));


--502010008料件销毁累计
SELECT [502010007料件销毁].帐册编号, Sum([502010007料件销毁].统计美元价) AS 料件销毁
FROM 502010007料件销毁
GROUP BY [502010007料件销毁].帐册编号;


--502010005料件退换进口
SELECT DISTINCT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].海关编号, 
[中间表-手册报关单].进出口标志, [中间表-手册报关单].备案批准日期, [中间表-手册报关单].最近核销日期, [中间表-手册报关单].申报日期, [中间表-手册报关单].贸易方式, 
[中间表-手册报关单].商品序号, [中间表-手册报关单].统计美元价
FROM [中间表-手册报关单]
WHERE ((([中间表-手册报关单].帐册编号) Like "B*" Or ([中间表-手册报关单].帐册编号) Like "C*") AND (([中间表-手册报关单].进出口标志)="I") 
AND (([中间表-手册报关单].最近核销日期) Is Not Null) AND (([中间表-手册报关单].贸易方式)="料件退换"));


--502010006退换进口
SELECT [502010005料件退换进口].帐册编号, Sum([502010005料件退换进口].统计美元价) AS 料件退换进口
FROM 502010005料件退换进口
GROUP BY [502010005料件退换进口].帐册编号;


--502010011成品核出
SELECT DISTINCT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].海关编号, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].备案批准日期, [中间表-手册报关单].最近核销日期, [中间表-手册报关单].申报日期, [中间表-手册报关单].贸易方式, 
[中间表-手册报关单].商品序号, [中间表-手册报关单].统计美元价
FROM [中间表-手册报关单]
WHERE ((([中间表-手册报关单].帐册编号) Like "B*" Or ([中间表-手册报关单].帐册编号) Like "C*") AND (([中间表-手册报关单].进出口标志)="E") 
AND (([中间表-手册报关单].最近核销日期) Is Not Null) AND (([中间表-手册报关单].贸易方式)="保税仓" 
Or ([中间表-手册报关单].贸易方式)="深加工结转" Or ([中间表-手册报关单].贸易方式)="实际进出"));

--502010012成品核出累计
SELECT [502010011成品核出].帐册编号, Sum([502010011成品核出].统计美元价) AS 成品核出
FROM 502010011成品核出
GROUP BY [502010011成品核出].帐册编号;


--502010003料件内销
SELECT DISTINCT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].海关编号, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].备案批准日期, [中间表-手册报关单].最近核销日期, [中间表-手册报关单].申报日期, [中间表-手册报关单].贸易方式, [中间表-手册报关单].商品序号, [中间表-手册报关单].统计美元价
FROM [中间表-手册报关单]
WHERE ((([中间表-手册报关单].帐册编号) Like "B*" Or ([中间表-手册报关单].帐册编号) Like "C*") AND (([中间表-手册报关单].进出口标志)="I") 
AND (([中间表-手册报关单].最近核销日期) Is Not Null) AND (([中间表-手册报关单].贸易方式)="料件内销"));


--502010004料件内销累计
SELECT [502010003料件内销].帐册编号, Sum([502010003料件内销].统计美元价) AS 料件内销
FROM 502010003料件内销
GROUP BY [502010003料件内销].帐册编号;


--502010001结案手册进口金额
SELECT DISTINCT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].收货单位名称, [中间表-手册报关单].海关编号, [中间表-手册报关单].进出口标志, 
[中间表-手册报关单].备案批准日期, [中间表-手册报关单].最近核销日期, [中间表-手册报关单].申报日期, [中间表-手册报关单].贸易方式, [中间表-手册报关单].商品序号, [中间表-手册报关单].统计美元价
FROM [中间表-手册报关单]
WHERE ((([中间表-手册报关单].帐册编号) Like "B*" Or ([中间表-手册报关单].帐册编号) Like "C*") AND (([中间表-手册报关单].进出口标志)="I") 
AND (([中间表-手册报关单].最近核销日期) Is Not Null) AND (([中间表-手册报关单].贸易方式)="实际进出" Or ([中间表-手册报关单].贸易方式)="深加工结转" 
Or ([中间表-手册报关单].贸易方式)="余料结转" Or ([中间表-手册报关单].贸易方式)="保税仓"));


--502010002核增金额累计
SELECT [502010001结案手册进口金额].主管海关, [502010001结案手册进口金额].帐册编号, [502010001结案手册进口金额].收货单位名称, [502010001结案手册进口金额].备案批准日期, 
[502010001结案手册进口金额].最近核销日期, Sum([502010001结案手册进口金额].统计美元价) AS 料件金额核增
FROM 502010001结案手册进口金额
GROUP BY [502010001结案手册进口金额].主管海关, [502010001结案手册进口金额].帐册编号, [502010001结案手册进口金额].收货单位名称, 
[502010001结案手册进口金额].备案批准日期, [502010001结案手册进口金额].最近核销日期;


--50201019金额倒挂
SELECT [502010002核增金额累计].帐册编号, [502010002核增金额累计].收货单位名称, [502010002核增金额累计].备案批准日期, [502010002核增金额累计].最近核销日期, [502010002核增金额累计].料件金额核增, 
[502010006退换进口].料件退换进口, [502010004料件内销累计].料件内销, [502010008料件销毁累计].料件销毁, [502010010退换复出累计].料件退换复出, 
[502010014余料转出累计].余料转出, [502010012成品核出累计].成品核出, [502010016成品退出累计].成品退出, [502010018成品退进累计].成品退进, 
Nz([料件金额核增])+Nz([料件退换进口])-Nz([料件内销])-Nz([料件销毁])-Nz([料件退换复出])-Nz([余料转出])-Nz([成品核出])-Nz([成品退出])+Nz([成品退进]) AS 倒挂金额
FROM (((((((502010002核增金额累计 
LEFT JOIN 502010004料件内销累计 ON [502010002核增金额累计].帐册编号 = [502010004料件内销累计].帐册编号)
LEFT JOIN 502010012成品核出累计 ON [502010002核增金额累计].帐册编号 = [502010012成品核出累计].帐册编号) 
LEFT JOIN 502010006退换进口 ON [502010002核增金额累计].帐册编号 = [502010006退换进口].帐册编号) 
LEFT JOIN 502010008料件销毁累计 ON [502010002核增金额累计].帐册编号 = [502010008料件销毁累计].帐册编号) 
LEFT JOIN 502010014余料转出累计 ON [502010002核增金额累计].帐册编号 = [502010014余料转出累计].帐册编号) 
LEFT JOIN 502010016成品退出累计 ON [502010002核增金额累计].帐册编号 = [502010016成品退出累计].帐册编号) 
LEFT JOIN 502010018成品退进累计 ON [502010002核增金额累计].帐册编号 = [502010018成品退进累计].帐册编号) 
LEFT JOIN 502010010退换复出累计 ON [502010002核增金额累计].帐册编号 = [502010010退换复出累计].帐册编号;



--数据结果表
SELECT [50201019金额倒挂].帐册编号, [50201019金额倒挂].备案批准日期, [50201019金额倒挂].最近核销日期, [50201019金额倒挂].料件金额核增, [50201019金额倒挂].料件退换进口, 
[50201019金额倒挂].料件内销, [50201019金额倒挂].料件销毁, [50201019金额倒挂].料件退换复出, [50201019金额倒挂].余料转出, [50201019金额倒挂].成品核出, 
[50201019金额倒挂].成品退出, [50201019金额倒挂].成品退进, [50201019金额倒挂].倒挂金额, Round([倒挂金额]/([料件金额核增]+[料件退换进口]+[成品退进]),2) AS 倒挂比率
FROM 50201019金额倒挂
WHERE (((Round([倒挂金额]/([料件金额核增]+[料件退换进口]+[成品退进]),2))>0));


---退换成品未复出

--中间表-手册报关单
--参数表-计量单位表

--02011001成品退换进口
SELECT [中间表-手册报关单].主管海关, [中间表-手册报关单].帐册编号, [中间表-手册报关单].备案批准日期, [中间表-手册报关单].最近核销日期, [中间表-手册报关单].收货单位名称, 
[中间表-手册报关单].海关编号, [中间表-手册报关单].申报日期, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号, 
[中间表-手册报关单].商品编号, [中间表-手册报关单].商品名称, [中间表-手册报关单].申报数量, [参数表-计量单位表].计量单位名称 AS 单位
FROM [中间表-手册报关单] 
LEFT JOIN [参数表-计量单位表] ON [中间表-手册报关单].申报计量单位 = [参数表-计量单位表].计量单位代码
WHERE ((([中间表-手册报关单].进出口标志)="i") AND (([中间表-手册报关单].贸易方式)="成品退换"));


--502011002成品退换进口累计
SELECT [502011001成品退换进口].主管海关, [502011001成品退换进口].帐册编号, [502011001成品退换进口].备案批准日期, [502011001成品退换进口].最近核销日期, 
[502011001成品退换进口].收货单位名称, [502011001成品退换进口].贸易方式, [502011001成品退换进口].合同商品项序号 AS 成品序号, [502011001成品退换进口].商品编号, 
[502011001成品退换进口].商品名称, Sum([502011001成品退换进口].申报数量) AS 退进数量, [502011001成品退换进口].单位
FROM 502011001成品退换进口
GROUP BY [502011001成品退换进口].主管海关, [502011001成品退换进口].帐册编号, [502011001成品退换进口].备案批准日期, 
[502011001成品退换进口].最近核销日期, [502011001成品退换进口].收货单位名称, [502011001成品退换进口].贸易方式, [502011001成品退换进口].合同商品项序号, 
[502011001成品退换进口].商品编号, [502011001成品退换进口].商品名称, [502011001成品退换进口].单位;


--502011005成品退换对比
SELECT "502011" AS 问题, [502011002成品退换进口累计].主管海关, [502011002成品退换进口累计].帐册编号, [502011002成品退换进口累计].备案批准日期, 
[502011002成品退换进口累计].最近核销日期, [502011002成品退换进口累计].收货单位名称, [502011002成品退换进口累计].贸易方式, [502011002成品退换进口累计].成品序号, 
[502011002成品退换进口累计].商品编号, [502011002成品退换进口累计].商品名称, [502011002成品退换进口累计].单位, [502011002成品退换进口累计].退进数量, 
[502011004成品退出累计].退出数量, Nz([退进数量])-Nz([退出数量]) AS 退换未出口数量
FROM 502011002成品退换进口累计 LEFT JOIN 502011004成品退出累计 ON ([502011002成品退换进口累计].成品序号 = [502011004成品退出累计].成品序号) 
AND ([502011002成品退换进口累计].帐册编号 = [502011004成品退出累计].帐册编号);


--数据结果表
SELECT [502011005成品退换对比].帐册编号, [502011005成品退换对比].备案批准日期, [502011005成品退换对比].最近核销日期, [502011005成品退换对比].贸易方式, 
[502011005成品退换对比].成品序号, [502011005成品退换对比].商品编号, [502011005成品退换对比].商品名称, [502011005成品退换对比].单位, [502011005成品退换对比].退进数量, 
[502011005成品退换对比].退出数量, [502011005成品退换对比].退换未出口数量
FROM 502011005成品退换对比
WHERE ((([502011005成品退换对比].退换未出口数量)>0));



----通关模式分布图(参考“一般贸易”“通关模式分布图”模块)
--”510010003进出口基础表“参考“进出口情况（监管方式）”计算方式
--中间表-查验情况表头

--数据结果表
SELECT a.进出标志, a.申报地, a.监管方式, Count(a.海关编号) AS 票数, Count(a.查验记录单号) AS 查验票数, Count(a.查验结果) AS 查获票数, Val(Sum(a.标箱)) AS 标箱, Sum(a.毛重) AS 毛重, 
Sum(a.净重) AS 净重, Round(Sum(a.统计美元价之合计)/10000,2) AS [金额(万美元)], Round(Val(Sum(a.税款之合计))/10000,2) AS [税款(万元)], a.年, a.月, a.申报口岸, a.贸易国, a.通关模式
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, 
[510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].备注, [510010003进出口基础表].标箱, [510010003进出口基础表].毛重, 
[510010003进出口基础表].净重, Sum([510010003进出口基础表].统计美元价) AS 统计美元价之合计, Sum([510010003进出口基础表].税款) AS 税款之合计, [510010003进出口基础表].通关模式, 
[中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验结果 
FROM 510010003进出口基础表 LEFT JOIN [中间表-查验情况表头] ON [510010003进出口基础表].海关编号 = [中间表-查验情况表头].海关编号 
GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, 
[510010003进出口基础表].年, [510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].备注, 
[510010003进出口基础表].标箱, [510010003进出口基础表].毛重, [510010003进出口基础表].净重, [510010003进出口基础表].通关模式, [中间表-查验情况表头].查验记录单号, 
[中间表-查验情况表头].查验结果 
HAVING ((([510010003进出口基础表].备注)="加贸")))  AS a
GROUP BY a.进出标志, a.申报地, a.年, a.月, a.申报口岸, a.监管方式, a.贸易国, a.通关模式;


--贸易国家分布图(参考“一般贸易”“贸易国家分布图”模块)
--”510010003进出口基础表“参考“进出口情况（监管方式）”计算方式
--中间表-查验情况表头

--数据结果表
SELECT a.进出标志, a.申报地, a.监管方式, Count(a.海关编号) AS 票数, Count(a.查验记录单号) AS 查验票数, Count(a.查验结果) AS 查获票数, Val(Sum(a.标箱)) AS 标箱, Sum(a.毛重) AS 毛重, 
Sum(a.净重) AS 净重, Round(Sum(a.统计美元价之合计)/10000,2) AS [金额(万美元)], Round(Val(Sum(a.税款之合计))/10000,2) AS [税款(万元)], a.年, a.月, a.申报口岸, a.贸易国, a.通关模式
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, 
[510010003进出口基础表].年, [510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].备注, 
[510010003进出口基础表].标箱, [510010003进出口基础表].毛重, [510010003进出口基础表].净重, Sum([510010003进出口基础表].统计美元价) AS 统计美元价之合计, 
Sum([510010003进出口基础表].税款) AS 税款之合计, [510010003进出口基础表].通关模式, [中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验结果 
FROM 510010003进出口基础表 LEFT JOIN [中间表-查验情况表头] ON [510010003进出口基础表].海关编号 = [中间表-查验情况表头].海关编号 
GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, 
[510010003进出口基础表].年, [510010003进出口基础表].月, [510010003进出口基础表].贸易国, [510010003进出口基础表].监管方式, [510010003进出口基础表].备注, 
[510010003进出口基础表].标箱, [510010003进出口基础表].毛重, [510010003进出口基础表].净重, [510010003进出口基础表].通关模式, [中间表-查验情况表头].查验记录单号, [中间表-查验情况表头].查验结果 
HAVING ((([510010003进出口基础表].备注)="加贸")))  AS a
GROUP BY a.进出标志, a.申报地, a.年, a.月, a.申报口岸, a.监管方式, a.贸易国, a.通关模式;

---手册平衡核算

--[中间表-手册报关单]
--中间表-手册单损耗



--502005033理论边角料
SELECT [5020050403成品耗用].帐册编号, Sum([5020050403成品耗用].边角料) AS 理论边角料, [5020050403成品耗用].料件序号
FROM 5020050403成品耗用
GROUP BY [5020050403成品耗用].帐册编号, [5020050403成品耗用].料件序号;

--502005032边角料复出
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号, Sum([中间表-手册报关单].申报数量) AS 边角料复出
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号
HAVING ((([中间表-手册报关单].进出口标志)="E") AND (([中间表-手册报关单].贸易方式)="边角料复出"));


--502005031边角料销毁
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号, Sum([中间表-手册报关单].申报数量) AS 边角料销毁
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号
HAVING ((([中间表-手册报关单].进出口标志)="i") AND (([中间表-手册报关单].贸易方式)="边角料销毁"));


--502005030边角料征税
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号, Sum([中间表-手册报关单].申报数量) AS 边角料征税
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号
HAVING ((([中间表-手册报关单].进出口标志)="i") AND (([中间表-手册报关单].贸易方式)="边角料"));



--502005002手册成品
SELECT [502005001手册核算表头].主管海关, [502005001手册核算表头].帐册编号, [502005001手册核算表头].经营单位代码, [502005001手册核算表头].收货单位名称, 
[502005001手册核算表头].备案批准日期, [502005001手册核算表头].结束有效期, [502005001手册核算表头].核销申请日期, [502005001手册核算表头].最近核销日期, [502005001手册核算表头].结案日期, 
[502005001手册核算表头].成品料件标志, [502005001手册核算表头].[帐册料件/成品序号] AS 成品序号, [502005001手册核算表头].商品编码 AS 成品编码, [502005001手册核算表头].商品名称 AS 成品名称, 
[502005001手册核算表头].申报计量单位, [502005001手册核算表头].备案数量
FROM 502005001手册核算表头
WHERE ((([502005001手册核算表头].成品料件标志)="E"));



--502005024仓储出口
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号 AS 成品序号, [中间表-手册报关单].成品版本, 
Sum([中间表-手册报关单].申报数量) AS 仓储出口
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号, [中间表-手册报关单].成品版本
HAVING ((([中间表-手册报关单].进出口标志)="e") AND (([中间表-手册报关单].贸易方式)="保税仓"));


--502005022成品退出
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号 AS 成品序号, [中间表-手册报关单].成品版本, 
Sum([中间表-手册报关单].申报数量) AS 成品退出
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号, [中间表-手册报关单].成品版本
HAVING ((([中间表-手册报关单].进出口标志)="e") AND (([中间表-手册报关单].贸易方式) Like "成品退*"));


--502005020成品实出
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号 AS 成品序号, [中间表-手册报关单].成品版本, 
Sum([中间表-手册报关单].申报数量) AS 成品实出
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号, [中间表-手册报关单].成品版本
HAVING ((([中间表-手册报关单].进出口标志)="e") AND (([中间表-手册报关单].贸易方式) Like "*实际*"));


--502005002手册成品
SELECT [502005001手册核算表头].主管海关, [502005001手册核算表头].帐册编号, [502005001手册核算表头].经营单位代码, [502005001手册核算表头].收货单位名称, 
[502005001手册核算表头].备案批准日期, [502005001手册核算表头].结束有效期, [502005001手册核算表头].核销申请日期, [502005001手册核算表头].最近核销日期, 
[502005001手册核算表头].结案日期, [502005001手册核算表头].成品料件标志, [502005001手册核算表头].[帐册料件/成品序号] AS 成品序号, [502005001手册核算表头].商品编码 AS 成品编码, 
[502005001手册核算表头].商品名称 AS 成品名称, [502005001手册核算表头].申报计量单位, [502005001手册核算表头].备案数量
FROM 502005001手册核算表头
WHERE ((([502005001手册核算表头].成品料件标志)="E"));


--5020050031手册成品
SELECT DISTINCT [502005002手册成品].帐册编号, [502005002手册成品].成品序号, [中间表-手册单损耗].成品版本, [502005002手册成品].成品编码, [502005002手册成品].成品名称, 
[参数表-计量单位表].计量单位名称 AS 成品计量
FROM (502005002手册成品 
LEFT JOIN [参数表-计量单位表] ON [502005002手册成品].申报计量单位 = [参数表-计量单位表].计量单位代码) 
LEFT JOIN [中间表-手册单损耗] ON ([502005002手册成品].成品序号 = [中间表-手册单损耗].成品序号) AND ([502005002手册成品].帐册编号 = [中间表-手册单损耗].帐册编号);


--5020050402成品核算
SELECT [5020050031手册成品].帐册编号, [5020050031手册成品].成品序号, [5020050031手册成品].成品版本, [5020050031手册成品].成品编码, [5020050031手册成品].成品名称, 
[5020050031手册成品].成品计量, [502005020成品实出].成品实出, [502005021深加工转出].深加工转出, [502005024仓储出口].仓储出口, [502005022成品退出].成品退出, 
[502005023成品退进].成品退进, Nz([成品实出])+Nz([深加工转出])+Nz([仓储出口])+Nz([成品退出])-Nz([成品退进]) AS 成品核算
FROM ((((5020050031手册成品 
LEFT JOIN 502005020成品实出 ON ([5020050031手册成品].成品版本 = [502005020成品实出].成品版本) AND ([5020050031手册成品].成品序号 = [502005020成品实出].成品序号) 
AND ([5020050031手册成品].帐册编号 = [502005020成品实出].帐册编号)) LEFT JOIN 502005021深加工转出 ON ([5020050031手册成品].成品版本 = [502005021深加工转出].成品版本) 
AND ([5020050031手册成品].成品序号 = [502005021深加工转出].成品序号) AND ([5020050031手册成品].帐册编号 = [502005021深加工转出].帐册编号)) 
LEFT JOIN 502005022成品退出 ON ([5020050031手册成品].成品版本 = [502005022成品退出].成品版本) AND ([5020050031手册成品].成品序号 = [502005022成品退出].成品序号) 
AND ([5020050031手册成品].帐册编号 = [502005022成品退出].帐册编号)) LEFT JOIN 502005023成品退进 ON ([5020050031手册成品].成品版本 = [502005023成品退进].成品版本) 
AND ([5020050031手册成品].成品序号 = [502005023成品退进].成品序号) AND ([5020050031手册成品].帐册编号 = [502005023成品退进].帐册编号)) 
LEFT JOIN 502005024仓储出口 ON ([5020050031手册成品].成品版本 = [502005024仓储出口].成品版本) AND ([5020050031手册成品].成品序号 = [502005024仓储出口].成品序号) 
AND ([5020050031手册成品].帐册编号 = [502005024仓储出口].帐册编号);


--5020050403成品耗用
SELECT [5020050402成品核算].帐册编号, [5020050402成品核算].成品序号, [5020050402成品核算].成品版本, [5020050402成品核算].成品编码, [5020050402成品核算].成品名称, 
[5020050402成品核算].成品实出, [5020050402成品核算].深加工转出, [5020050402成品核算].仓储出口, [5020050402成品核算].成品退出, [5020050402成品核算].成品退进, 
[5020050402成品核算].成品核算, [中间表-手册单损耗].料件序号, [502005003手册料件].料件编码, [502005003手册料件].料件名称, [中间表-手册单损耗].单耗, [中间表-手册单损耗].损耗, 
Round(Nz([成品核算])*[单耗]/(1-([损耗]/100)),2) AS 出口耗用, Round(Nz([出口耗用])-(Nz([成品核算])*Nz([单耗])),2) AS 边角料
FROM 5020050402成品核算 
LEFT JOIN ([中间表-手册单损耗] 
LEFT JOIN 502005003手册料件 ON ([中间表-手册单损耗].帐册编号 = [502005003手册料件].帐册编号) AND ([中间表-手册单损耗].料件序号 = [502005003手册料件].料件序号)) 
ON ([5020050402成品核算].成品版本 = [中间表-手册单损耗].成品版本) AND ([5020050402成品核算].成品序号 = [中间表-手册单损耗].成品序号) 
AND ([5020050402成品核算].帐册编号 = [中间表-手册单损耗].帐册编号);


--5020050404料件出口耗用
SELECT [5020050403成品耗用].帐册编号, [5020050403成品耗用].料件序号, Sum([5020050403成品耗用].出口耗用) AS 出口耗用, Sum([5020050403成品耗用].边角料) AS 理论边角料
FROM 5020050403成品耗用
GROUP BY [5020050403成品耗用].帐册编号, [5020050403成品耗用].料件序号;


--5020050190后续补税
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号 AS 料件序号, Sum([中间表-手册报关单].申报数量) AS 后续补税
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号
HAVING ((([中间表-手册报关单].进出口标志)="i") AND (([中间表-手册报关单].贸易方式)="后续补税"));


--502005019料件销毁
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号 AS 料件序号, Sum([中间表-手册报关单].申报数量) AS 料件销毁
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号
HAVING ((([中间表-手册报关单].进出口标志)="i") AND (([中间表-手册报关单].贸易方式)="料件销毁"));


--502005013仓储转入
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号 AS 料件序号, Sum([中间表-手册报关单].申报数量) AS 仓储转入
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号
HAVING ((([中间表-手册报关单].进出口标志)="i") AND (([中间表-手册报关单].贸易方式) Like "*保税仓*"));


--502005012深加工转入
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号 AS 料件序号, Sum([中间表-手册报关单].申报数量) AS 深加工转入
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号
HAVING ((([中间表-手册报关单].进出口标志)="i") AND (([中间表-手册报关单].贸易方式) Like "*深加工*"));


--502005018料件内销
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号 AS 料件序号, Sum([中间表-手册报关单].申报数量) AS 料件内销
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号
HAVING ((([中间表-手册报关单].进出口标志)="i") AND (([中间表-手册报关单].贸易方式)="料件内销"));


--502005011余料转入
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号 AS 料件序号, Sum([中间表-手册报关单].申报数量) AS 余料转入
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号
HAVING ((([中间表-手册报关单].进出口标志)="i") AND (([中间表-手册报关单].贸易方式) Like "*余料*"));


--502005017余料转出
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号 AS 料件序号, Sum([中间表-手册报关单].申报数量) AS 余料转出
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号
HAVING ((([中间表-手册报关单].进出口标志)="e") AND (([中间表-手册报关单].贸易方式) Like "余料*"));


--502005010料件实进
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号 AS 料件序号, Sum([中间表-手册报关单].申报数量) AS 料件实进
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号
HAVING ((([中间表-手册报关单].进出口标志)="i") AND (([中间表-手册报关单].贸易方式) Like "*实际*"));


--502005016料件退出
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号 AS 料件序号, Sum([中间表-手册报关单].申报数量) AS 料件退出
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号
HAVING ((([中间表-手册报关单].进出口标志)="e") AND (([中间表-手册报关单].贸易方式)="料件退换"));


--502005014料件退进
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号 AS 料件序号, Sum([中间表-手册报关单].申报数量) AS 料件退进
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号
HAVING ((([中间表-手册报关单].进出口标志)="i") AND (([中间表-手册报关单].贸易方式)="料件退换"));


--502005015料件复出
SELECT [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号 AS 料件序号, Sum([中间表-手册报关单].申报数量) AS 料件复出
FROM [中间表-手册报关单]
GROUP BY [中间表-手册报关单].帐册编号, [中间表-手册报关单].进出口标志, [中间表-手册报关单].贸易方式, [中间表-手册报关单].合同商品项序号
HAVING ((([中间表-手册报关单].进出口标志)="e") AND (([中间表-手册报关单].贸易方式)="料件复出"));



--5020050401料件核算
最近核销日期, [502005003手册料件].料件序号, [502005003手册料件].料件编码, [502005003手册料件].料件名称, [参数表-计量单位表].计量单位名称 AS 单位, [502005003手册料件].备案数量, 
[502005003手册料件].初始数量, [502005010料件实进].料件实进, [502005011余料转入].余料转入, [502005012深加工转入].深加工转入, [502005013仓储转入].仓储转入, [502005014料件退进].料件退进, 
[502005016料件退出].料件退出, [502005015料件复出].料件复出, [502005017余料转出].余料转出, [502005018料件内销].料件内销, [502005019料件销毁].料件销毁, [5020050190后续补税].后续补税, 
Nz([初始数量])+Nz([料件实进])+Nz([余料转入])+Nz([深加工转入])+Nz([仓储转入])+Nz([料件退进])-Nz([料件退出])-Nz([料件复出])-Nz([余料转出])-Nz([料件内销])-Nz([料件销毁]) AS 料件核算
FROM (((((((((((502005003手册料件 
LEFT JOIN 502005015料件复出 ON ([502005003手册料件].帐册编号 = [502005015料件复出].帐册编号) AND ([502005003手册料件].料件序号 = [502005015料件复出].料件序号)) 
LEFT JOIN 502005014料件退进 ON ([502005003手册料件].帐册编号 = [502005014料件退进].帐册编号) AND ([502005003手册料件].料件序号 = [502005014料件退进].料件序号)) 
LEFT JOIN 502005016料件退出 ON ([502005003手册料件].帐册编号 = [502005016料件退出].帐册编号) AND ([502005003手册料件].料件序号 = [502005016料件退出].料件序号)) 
LEFT JOIN 502005010料件实进 ON ([502005003手册料件].帐册编号 = [502005010料件实进].帐册编号) AND ([502005003手册料件].料件序号 = [502005010料件实进].料件序号)) 
LEFT JOIN 502005017余料转出 ON ([502005003手册料件].帐册编号 = [502005017余料转出].帐册编号) AND ([502005003手册料件].料件序号 = [502005017余料转出].料件序号)) 
LEFT JOIN 502005011余料转入 ON ([502005003手册料件].帐册编号 = [502005011余料转入].帐册编号) AND ([502005003手册料件].料件序号 = [502005011余料转入].料件序号)) 
LEFT JOIN 502005018料件内销 ON ([502005003手册料件].帐册编号 = [502005018料件内销].帐册编号) AND ([502005003手册料件].料件序号 = [502005018料件内销].料件序号)) 
LEFT JOIN 502005012深加工转入 ON ([502005003手册料件].帐册编号 = [502005012深加工转入].帐册编号) AND ([502005003手册料件].料件序号 = [502005012深加工转入].料件序号)) 
LEFT JOIN 502005013仓储转入 ON ([502005003手册料件].帐册编号 = [502005013仓储转入].帐册编号) AND ([502005003手册料件].料件序号 = [502005013仓储转入].料件序号)) 
LEFT JOIN 502005019料件销毁 ON ([502005003手册料件].帐册编号 = [502005019料件销毁].帐册编号) AND ([502005003手册料件].料件序号 = [502005019料件销毁].料件序号)) 
LEFT JOIN [参数表-计量单位表] ON [502005003手册料件].申报计量单位 = [参数表-计量单位表].计量单位代码) 
LEFT JOIN 5020050190后续补税 ON ([502005003手册料件].帐册编号 = [5020050190后续补税].帐册编号) AND ([502005003手册料件].料件序号 = [5020050190后续补税].料件序号);


--502005001手册核算表头(参考汕头逻辑整理第一部分)

--502005003手册料件
SELECT [502005001手册核算表头].主管海关, [502005001手册核算表头].帐册编号, [502005001手册核算表头].经营单位代码, [502005001手册核算表头].收货单位名称, 
[502005001手册核算表头].备案批准日期, [502005001手册核算表头].结束有效期, [502005001手册核算表头].核销申请日期, [502005001手册核算表头].最近核销日期, 
[502005001手册核算表头].结案日期, [502005001手册核算表头].成品料件标志, [502005001手册核算表头].[帐册料件/成品序号] AS 料件序号, [502005001手册核算表头].商品编码 AS 料件编码, 
[502005001手册核算表头].商品名称 AS 料件名称, [502005001手册核算表头].申报计量单位, [502005001手册核算表头].备案数量, [502005001手册核算表头].初始数量
FROM 502005001手册核算表头
WHERE ((([502005001手册核算表头].成品料件标志)="I"));

--数据结果表
SELECT [502005003手册料件].帐册编号, [502005003手册料件].备案批准日期, [502005003手册料件].结束有效期, [502005003手册料件].核销申请日期, [502005003手册料件].最近核销日期, 
[502005003手册料件].结案日期, [502005003手册料件].料件序号, [502005003手册料件].料件编码, [502005003手册料件].料件名称, [5020050401料件核算].单位, 
[5020050401料件核算].备案数量, [5020050401料件核算].初始数量, [5020050401料件核算].料件实进, [5020050401料件核算].余料转入, [5020050401料件核算].深加工转入, 
[5020050401料件核算].仓储转入, [5020050401料件核算].料件退进, [5020050401料件核算].料件退出, [5020050401料件核算].料件复出, [5020050401料件核算].余料转出, [5020050401料件核算].料件内销, 
[5020050401料件核算].料件销毁, [5020050401料件核算].后续补税, [5020050401料件核算].料件核算, [5020050404料件出口耗用].出口耗用, Round(([料件核算]-[出口耗用]),1) AS 理论应存, 
[502005030边角料征税].边角料征税, [502005031边角料销毁].边角料销毁, [502005032边角料复出].边角料复出, [502005033理论边角料].理论边角料, 
Round(Nz([502005033理论边角料]![理论边角料])-Nz([边角料征税])-Nz([边角料销毁])-Nz([边角料复出]),1) AS 未处理边角料, IIf(Nz([502005033理论边角料]![理论边角料])=0,Null,
Round([未处理边角料]/[502005033理论边角料]![理论边角料],2)) AS 未处理占比
FROM (((((502005003手册料件 
LEFT JOIN 5020050401料件核算 ON ([502005003手册料件].帐册编号 = [5020050401料件核算].帐册编号) AND ([502005003手册料件].料件序号 = [5020050401料件核算].料件序号)) 
LEFT JOIN 5020050404料件出口耗用 ON ([502005003手册料件].帐册编号 = [5020050404料件出口耗用].帐册编号) AND ([502005003手册料件].料件序号 = [5020050404料件出口耗用].料件序号)) 
LEFT JOIN 502005030边角料征税 ON ([502005003手册料件].料件序号 = [502005030边角料征税].合同商品项序号) AND ([502005003手册料件].帐册编号 = [502005030边角料征税].帐册编号)) 
LEFT JOIN 502005031边角料销毁 ON ([502005003手册料件].料件序号 = [502005031边角料销毁].合同商品项序号) AND ([502005003手册料件].帐册编号 = [502005031边角料销毁].帐册编号)) 
LEFT JOIN 502005032边角料复出 ON ([502005003手册料件].料件序号 = [502005032边角料复出].合同商品项序号) AND ([502005003手册料件].帐册编号 = [502005032边角料复出].帐册编号)) 
LEFT JOIN 502005033理论边角料 ON ([502005003手册料件].料件序号 = [502005033理论边角料].料件序号) AND ([502005003手册料件].帐册编号 = [502005033理论边角料].帐册编号);

--手册不平衡结案

--中间表-手册报关单
--502005003手册料件，参考“手册平衡核算”里面的计算

--5020050501料件进口
SELECT [502005003手册料件].帐册编号, [502005003手册料件].成品料件标志, [502005003手册料件].料件序号, [中间表-手册报关单].海关编号, [中间表-手册报关单].贸易方式, 
[中间表-手册报关单].申报数量, [中间表-手册报关单].统计美元价
FROM 502005003手册料件 
INNER JOIN [中间表-手册报关单] ON ([502005003手册料件].料件序号 = [中间表-手册报关单].合同商品项序号) AND ([502005003手册料件].成品料件标志 = [中间表-手册报关单].进出口标志) 
AND ([502005003手册料件].帐册编号 = [中间表-手册报关单].帐册编号)
WHERE ((([中间表-手册报关单].贸易方式)="实际进出" Or ([中间表-手册报关单].贸易方式) Like "深加工*" Or ([中间表-手册报关单].贸易方式) Like "余料*"));


--5020050502料件进口汇总
SELECT [5020050501料件进口].帐册编号, [5020050501料件进口].成品料件标志, [5020050501料件进口].料件序号, Sum([5020050501料件进口].申报数量) AS 申报数量之合计, 
Sum([5020050501料件进口].统计美元价) AS 统计美元价之合计
FROM 5020050501料件进口
GROUP BY [5020050501料件进口].帐册编号, [5020050501料件进口].成品料件标志, [5020050501料件进口].料件序号;

--5020050503料件进口加权价
SELECT [5020050502料件进口汇总].帐册编号, [5020050502料件进口汇总].成品料件标志, [5020050502料件进口汇总].料件序号, [5020050502料件进口汇总].申报数量之合计, 
[5020050502料件进口汇总].统计美元价之合计, Round([统计美元价之合计]/[申报数量之合计],2) AS 加权均价
FROM 5020050502料件进口汇总;

--502005003手册料件，参考“手册平衡核算”里面的计算
--5020050401料件核算，参考“手册平衡核算”里面的计算
--5020050404料件出口耗用，参考“手册平衡核算”里面的计算
--502005030边角料征税，参考“手册平衡核算”里面的计算
--502005031边角料销毁，参考“手册平衡核算”里面的计算
--502005032边角料复出，参考“手册平衡核算”里面的计算
--502005033理论边角料，参考“手册平衡核算”里面的计算

--50200504手册平衡核算
SELECT [502005003手册料件].帐册编号, [502005003手册料件].备案批准日期, [502005003手册料件].结束有效期, [502005003手册料件].核销申请日期, [502005003手册料件].最近核销日期, 
[502005003手册料件].结案日期, [502005003手册料件].料件序号, [502005003手册料件].料件编码, [502005003手册料件].料件名称, [5020050401料件核算].单位, [5020050401料件核算].备案数量, 
[5020050401料件核算].初始数量, [5020050401料件核算].料件实进, [5020050401料件核算].余料转入, [5020050401料件核算].深加工转入, [5020050401料件核算].仓储转入, [5020050401料件核算].料件退进, 
[5020050401料件核算].料件退出, [5020050401料件核算].料件复出, [5020050401料件核算].余料转出, [5020050401料件核算].料件内销, [5020050401料件核算].料件销毁, [5020050401料件核算].后续补税, 
[5020050401料件核算].料件核算, [5020050404料件出口耗用].出口耗用, Round(([料件核算]-[出口耗用]),1) AS 理论应存, [502005030边角料征税].边角料征税, [502005031边角料销毁].边角料销毁, 
[502005032边角料复出].边角料复出, [502005033理论边角料].理论边角料, Round(Nz([502005033理论边角料]![理论边角料])-Nz([边角料征税])-Nz([边角料销毁])-Nz([边角料复出]),1) AS 未处理边角料, 
IIf(Nz([502005033理论边角料]![理论边角料])=0,Null,Round([未处理边角料]/[502005033理论边角料]![理论边角料],2)) AS 未处理占比
FROM (((((502005003手册料件 
LEFT JOIN 5020050401料件核算 ON ([502005003手册料件].料件序号 = [5020050401料件核算].料件序号) AND ([502005003手册料件].帐册编号 = [5020050401料件核算].帐册编号))
LEFT JOIN 5020050404料件出口耗用 ON ([502005003手册料件].料件序号 = [5020050404料件出口耗用].料件序号) AND ([502005003手册料件].帐册编号 = [5020050404料件出口耗用].帐册编号)) 
LEFT JOIN 502005030边角料征税 ON ([502005003手册料件].帐册编号 = [502005030边角料征税].帐册编号) AND ([502005003手册料件].料件序号 = [502005030边角料征税].合同商品项序号)) 
LEFT JOIN 502005031边角料销毁 ON ([502005003手册料件].帐册编号 = [502005031边角料销毁].帐册编号) AND ([502005003手册料件].料件序号 = [502005031边角料销毁].合同商品项序号)) 
LEFT JOIN 502005032边角料复出 ON ([502005003手册料件].帐册编号 = [502005032边角料复出].帐册编号) AND ([502005003手册料件].料件序号 = [502005032边角料复出].合同商品项序号)) 
LEFT JOIN 502005033理论边角料 ON ([502005003手册料件].帐册编号 = [502005033理论边角料].帐册编号) AND ([502005003手册料件].料件序号 = [502005033理论边角料].料件序号);


--5020050500不平衡结案
SELECT [50200504手册平衡核算].帐册编号, [50200504手册平衡核算].备案批准日期, [50200504手册平衡核算].结束有效期, [50200504手册平衡核算].核销申请日期, [50200504手册平衡核算].最近核销日期, 
[50200504手册平衡核算].料件序号, [50200504手册平衡核算].料件编码, [50200504手册平衡核算].料件名称, [50200504手册平衡核算].单位, [50200504手册平衡核算].备案数量, 
[50200504手册平衡核算].初始数量, [50200504手册平衡核算].料件实进, [50200504手册平衡核算].余料转入, [50200504手册平衡核算].深加工转入, [50200504手册平衡核算].仓储转入, 
[50200504手册平衡核算].料件退进, [50200504手册平衡核算].料件退出, [50200504手册平衡核算].料件复出, [50200504手册平衡核算].余料转出, [50200504手册平衡核算].料件内销, 
[50200504手册平衡核算].料件销毁, [50200504手册平衡核算].后续补税, [50200504手册平衡核算].料件核算, [50200504手册平衡核算].出口耗用, [50200504手册平衡核算].理论应存, 
IIf([理论应存]=0,0,IIf([料件核算]=0,0,IIf([出口耗用]=0,0,Round(Nz([理论应存])/Nz([料件核算]),3)))) AS 剩余料件比率, [50200504手册平衡核算].边角料征税, 
[50200504手册平衡核算].边角料销毁, [50200504手册平衡核算].边角料复出, [50200504手册平衡核算].理论边角料, [50200504手册平衡核算].未处理边角料
FROM 50200504手册平衡核算
WHERE ((([50200504手册平衡核算].帐册编号) Not Like "E*") AND (([50200504手册平衡核算].最近核销日期) Is Not Null) AND ((IIf([理论应存]=0,0,IIf([料件核算]=0,0,IIf([出口耗用]=0,0,
Round(Nz([理论应存])/Nz([料件核算]),3)))))>0.02));


--数据结果表
SELECT [5020050500不平衡结案].帐册编号, [5020050500不平衡结案].备案批准日期, [5020050500不平衡结案].结束有效期, [5020050500不平衡结案].核销申请日期, [5020050500不平衡结案].最近核销日期, 
[5020050500不平衡结案].料件序号, [5020050500不平衡结案].料件编码, [5020050500不平衡结案].料件名称, [5020050500不平衡结案].单位, [5020050500不平衡结案].备案数量, 
[5020050500不平衡结案].初始数量, [5020050500不平衡结案].料件实进, [5020050500不平衡结案].余料转入, [5020050500不平衡结案].深加工转入, [5020050500不平衡结案].仓储转入, 
[5020050500不平衡结案].料件退进, [5020050500不平衡结案].料件退出, [5020050500不平衡结案].料件复出, [5020050500不平衡结案].余料转出, [5020050500不平衡结案].料件内销, 
[5020050500不平衡结案].料件销毁, [5020050500不平衡结案].后续补税, [5020050500不平衡结案].料件核算, [5020050500不平衡结案].出口耗用, [5020050500不平衡结案].理论应存, 
[5020050503料件进口加权价].加权均价, Round([理论应存]*[加权均价],0) AS 余料美元值, [5020050500不平衡结案].剩余料件比率, [5020050500不平衡结案].边角料征税, 
[5020050500不平衡结案].边角料销毁, [5020050500不平衡结案].边角料复出, [5020050500不平衡结案].理论边角料, [5020050500不平衡结案].未处理边角料
FROM 5020050500不平衡结案 
LEFT JOIN 5020050503料件进口加权价 ON ([5020050500不平衡结案].料件序号 = [5020050503料件进口加权价].料件序号) AND ([5020050500不平衡结案].帐册编号 = [5020050503料件进口加权价].帐册编号)
WHERE (((Round([理论应存]*[加权均价],0))>2000) AND (([5020050500不平衡结案].剩余料件比率)>0.01));


----------------------------------------------------------------------------------------------------------------

--本地开税单情况

--510040001税单
SELECT dbo.DUTYFORM_HEAD.DECL_PORT AS 申报口岸代码, dbo.DUTYFORM_HEAD.ENTRY_ID AS 海关编号,dbo.DUTYFORM_HEAD.PAYER_CODE AS 缴款单位编码, dbo.DUTYFORM_HEAD.PAYER_NAME AS 缴款单位名称,  
dbo.DUTYFORM_HEAD.DUTYFORM_FLAG AS 税单标志, dbo.DUTYFORM_LIST.DUTY_FLAG AS 退补税标志, dbo.DUTYFORM_LIST.TAX_TYPE AS 税费种类, dbo.DUTYFORM_LIST.PAY_MODE AS 支付方式, 
dbo.DUTYFORM_LIST.REAL_TAX AS 税款金额, dbo.DUTYFORM_LIST.P_DATE AS 打印日期, dbo.DUTYFORM_LIST.SYS_DATE AS 金库回执核销操作日期, YEAR(dbo.DUTYFORM_LIST.P_DATE) AS '开单年份', 
MONTH(dbo.DUTYFORM_LIST.P_DATE) AS '开单月份' 
FROM         dbo.DUTYFORM_HEAD INNER JOIN dbo.DUTYFORM_LIST ON dbo.DUTYFORM_HEAD.ENTRY_ID = dbo.DUTYFORM_LIST.ENTRY_ID 
WHERE dbo.DUTYFORM_HEAD.PAYER_CODE ='3205641024' AND dbo.DUTYFORM_LIST.P_DATE BETWEEN  '2017-6-1' And '2018-3-17' 

--数据结果表
SELECT [参数表-关区代码].海关名称 AS 开单现场, [510040001税单].海关编号, [510040001税单].缴款单位编码, [510040001税单].缴款单位名称, [参数表-税单标志代码].税单标志, 
[参数表-税单退补标志代码].退补税, [参数表-税种科目].税种名称, [510040001税单].打印日期 AS 开单日期, [510040001税单].金库回执核销操作日期, [510040001税单].开单年份, 
[510040001税单].开单月份, IIf([510040001税单]![支付方式]="6","电子支付",IIf([510040001税单]![支付方式]="7","电子支付",IIf([510040001税单]![支付方式]="1","柜台支付","其他"))) AS 支付方式, 
Round([510040001税单]![税款金额]/10000,2) AS [税款(万元)]
FROM (((510040001税单 
LEFT JOIN [参数表-税单标志代码] ON [510040001税单].税单标志 = [参数表-税单标志代码].税单标志代码) 
LEFT JOIN [参数表-税单退补标志代码] ON [510040001税单].退补税标志 = [参数表-税单退补标志代码].退补税标志) 
LEFT JOIN [参数表-税种科目] ON [510040001税单].税费种类 = [参数表-税种科目].税种代码) 
LEFT JOIN [参数表-关区代码] ON [510040001税单].申报口岸代码 = [参数表-关区代码].海关代码;


--报关纳税监管方式

--”510010003进出口基础表“参考“进出口情况（监管方式）”计算方式

--数据结果表  51004002涉税基础表
SELECT a.进出标志, a.申报地, a.申报口岸, a.年, a.月, a.监管方式, a.通关模式, a.产销国, Round(Sum(a.统计美元价之合计)/10000,2) AS [金额(万美元)], 
Round(Val(Sum(a.税款之合计))/10000,2) AS [税款(万元)]
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, 
[510010003进出口基础表].年, [510010003进出口基础表].月, [510010003进出口基础表].产销国, [510010003进出口基础表].监管方式, Sum([510010003进出口基础表].统计美元价) AS 统计美元价之合计, 
Sum([510010003进出口基础表].税款) AS 税款之合计, [510010003进出口基础表].通关模式 
FROM 510010003进出口基础表 GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, 
[510010003进出口基础表].海关编号, [510010003进出口基础表].年, [510010003进出口基础表].月, [510010003进出口基础表].产销国, [510010003进出口基础表].监管方式, [510010003进出口基础表].通关模式 
HAVING (((Sum([510010003进出口基础表].税款))>0)))  AS a
GROUP BY a.进出标志, a.申报地, a.申报口岸, a.年, a.月, a.监管方式, a.通关模式, a.产销国;


--报关纳税通关模式
--”510010003进出口基础表“参考“进出口情况（监管方式）”计算方式

--数据结果表 51004002涉税基础表
SELECT a.进出标志, a.申报地, a.申报口岸, a.年, a.月, a.监管方式, a.通关模式, a.产销国, Round(Sum(a.统计美元价之合计)/10000,2) AS [金额(万美元)], 
Round(Val(Sum(a.税款之合计))/10000,2) AS [税款(万元)]
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, 
[510010003进出口基础表].年, [510010003进出口基础表].月, [510010003进出口基础表].产销国, [510010003进出口基础表].监管方式, Sum([510010003进出口基础表].统计美元价) AS 统计美元价之合计, 
Sum([510010003进出口基础表].税款) AS 税款之合计, [510010003进出口基础表].通关模式 FROM 510010003进出口基础表 GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, 
[510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, [510010003进出口基础表].月, [510010003进出口基础表].产销国, 
[510010003进出口基础表].监管方式, [510010003进出口基础表].通关模式 HAVING (((Sum([510010003进出口基础表].税款))>0)))  AS a
GROUP BY a.进出标志, a.申报地, a.申报口岸, a.年, a.月, a.监管方式, a.通关模式, a.产销国;


----涉税商品分布表

--”510010003进出口基础表“参考“进出口情况（监管方式）”计算方式


---数据结果表 51004005涉税商品基础表
SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, 
[510010003进出口基础表].月, [510010003进出口基础表].产销国, [510010003进出口基础表].监管方式, [510010003进出口基础表].统计美元价, [510010003进出口基础表].税款, [510010003进出口基础表].通关模式, 
[510010003进出口基础表].商品编号, [510010003进出口基础表].商品名称, [510010003进出口基础表].完税价格
FROM 510010003进出口基础表
WHERE ((([510010003进出口基础表].税款)>0));


---税单月度态势图

--510040001税单 参考“本地开税单情况”计算逻辑

---数据结果表 510040001开税单清单
SELECT [参数表-关区代码].海关名称 AS 开单现场, [510040001税单].海关编号, [510040001税单].缴款单位编码, [510040001税单].缴款单位名称, [参数表-税单标志代码].税单标志, 
[参数表-税单退补标志代码].退补税, [参数表-税种科目].税种名称, [510040001税单].打印日期 AS 开单日期, [510040001税单].金库回执核销操作日期, [510040001税单].开单年份, 
[510040001税单].开单月份, IIf([510040001税单]![支付方式]="6","电子支付",IIf([510040001税单]![支付方式]="7","电子支付",IIf([510040001税单]![支付方式]="1","柜台支付","其他"))) AS 支付方式, 
Round([510040001税单]![税款金额]/10000,2) AS [税款(万元)]
FROM (((510040001税单 
LEFT JOIN [参数表-税单标志代码] ON [510040001税单].税单标志 = [参数表-税单标志代码].税单标志代码) 
LEFT JOIN [参数表-税单退补标志代码] ON [510040001税单].退补税标志 = [参数表-税单退补标志代码].退补税标志)
 LEFT JOIN [参数表-税种科目] ON [510040001税单].税费种类 = [参数表-税种科目].税种代码) 
 LEFT JOIN [参数表-关区代码] ON [510040001税单].申报口岸代码 = [参数表-关区代码].海关代码;






---报关纳税现场分布
--”510010003进出口基础表“参考“进出口情况（监管方式）”计算方式

--数据结果表 51004002涉税基础表
SELECT a.进出标志, a.申报地, a.申报口岸, a.年, a.月, a.监管方式, a.通关模式, a.产销国, Round(Sum(a.统计美元价之合计)/10000,2) AS [金额(万美元)], 
Round(Val(Sum(a.税款之合计))/10000,2) AS [税款(万元)]
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, 
[510010003进出口基础表].月, [510010003进出口基础表].产销国, [510010003进出口基础表].监管方式, Sum([510010003进出口基础表].统计美元价) AS 统计美元价之合计,
 Sum([510010003进出口基础表].税款) AS 税款之合计, [510010003进出口基础表].通关模式 
 FROM 510010003进出口基础表 GROUP BY [510010003进出口基础表].进出标志, 
 [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, [510010003进出口基础表].月, 
 [510010003进出口基础表].产销国, [510010003进出口基础表].监管方式, [510010003进出口基础表].通关模式 HAVING (((Sum([510010003进出口基础表].税款))>0)))  AS a
GROUP BY a.进出标志, a.申报地, a.申报口岸, a.年, a.月, a.监管方式, a.通关模式, a.产销国;


---报关纳税原产地
--”510010003进出口基础表“参考“进出口情况（监管方式）”计算方式

--数据结果表 51004002涉税基础表
SELECT a.进出标志, a.申报地, a.申报口岸, a.年, a.月, a.监管方式, a.通关模式, a.产销国, Round(Sum(a.统计美元价之合计)/10000,2) AS [金额(万美元)], 
Round(Val(Sum(a.税款之合计))/10000,2) AS [税款(万元)]
FROM (SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, 
[510010003进出口基础表].年, [510010003进出口基础表].月, [510010003进出口基础表].产销国, [510010003进出口基础表].监管方式, Sum([510010003进出口基础表].统计美元价) AS 统计美元价之合计, 
Sum([510010003进出口基础表].税款) AS 税款之合计, [510010003进出口基础表].通关模式 
FROM 510010003进出口基础表 GROUP BY [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, 
[510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, [510010003进出口基础表].月, [510010003进出口基础表].产销国, 
[510010003进出口基础表].监管方式, [510010003进出口基础表].通关模式 HAVING (((Sum([510010003进出口基础表].税款))>0)))  AS a
GROUP BY a.进出标志, a.申报地, a.申报口岸, a.年, a.月, a.监管方式, a.通关模式, a.产销国;

---报关纳税月度态势
--”510010003进出口基础表“参考“进出口情况（监管方式）”计算方式

--数据结果表 51004005涉税商品基础表
SELECT [510010003进出口基础表].进出标志, [510010003进出口基础表].申报地, [510010003进出口基础表].申报口岸, [510010003进出口基础表].海关编号, [510010003进出口基础表].年, 
[510010003进出口基础表].月, [510010003进出口基础表].产销国, [510010003进出口基础表].监管方式, [510010003进出口基础表].统计美元价, [510010003进出口基础表].税款, 
[510010003进出口基础表].通关模式, [510010003进出口基础表].商品编号, [510010003进出口基础表].商品名称, [510010003进出口基础表].完税价格
FROM 510010003进出口基础表
WHERE ((([510010003进出口基础表].税款)>0));